zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
/*
 * Copyright (c) 2020, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/**
 * @brief 文件用途：MSPM0G3507 I2C 驱动库头文件。
 *        提供 I2C 控制器/目标模式的完整寄存器操作接口，包括：
 *        时钟配置、FIFO 读写、传输控制、地址管理、中断/DMA 事件、
 *        毛刺滤波、超时检测及 SMBus/PMBus PEC 校验等功能。
 */
/*!****************************************************************************
 *  @file       dl_i2c.h
 *  @brief      Inter-Integrated Circuit (I2C) Driver Library
 *  @defgroup   I2C  Inter-Integrated Circuit (I2C)
 *
 *  @anchor ti_dl_dl_i2c_Overview
 *  # Overview
 *
 *   The I2C Library allows full configuration of the MSPM0 I2C module.
 *   The I2C module provides a standardized serial interface to transfer data
 *   between MSP devices and other external I2C devices (such as a sensors,
 *   memory, or DACs).
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup I2C
 * @{
 */
#ifndef ti_dl_dl_i2c__include
#define ti_dl_dl_i2c__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#ifdef __MSPM0_HAS_I2C__

#ifdef __cplusplus
extern "C"
{
#endif

    /* clang-format off */

/*!
 * @brief I2C number of bytes which could be put into the TX FIFO
 *        I2C TX FIFO 最大容量（字节数），由设备头文件中的 I2C_SYS_FENTRIES 计算得出。
 *
 * This variable is device specific and is calculated using the system parameter
 * I2C_SYS_FENTRIES defined in each devices header file.
*/
#define DL_I2C_TX_FIFO_COUNT_MAXIMUM          ((uint32_t)I2C_SYS_FENTRIES << 8)

/*!
 * @brief I2C number of bytes which could be put into the RX FIFO
 *        I2C RX FIFO 最大容量（字节数），由设备头文件中的 I2C_SYS_FENTRIES 计算得出。
 *
 * This variable is device specific and is calculated using the system parameter
 * I2C_SYS_FENTRIES defined in each devices header file.
*/
#define DL_I2C_RX_FIFO_COUNT_MAXIMUM               ((uint32_t)I2C_SYS_FENTRIES)

/** @addtogroup DL_I2C_CONTROLLER_STATUS
 *  @{
 */
/*!
 * @brief I2C is busy
 *        I2C 控制器忙标志，事务进行中置位（含 START/RESTART/地址/STOP 信号生成期间）。
 *
 * The BUSY bit is set during an ongoing transaction, so is set during the
 * transmit/receive of the amount of data set in WBLEN including START, RESTART,
 * Address and STOP signal generation when required for the current transaction
 */
#define DL_I2C_CONTROLLER_STATUS_BUSY                       (I2C_MSR_BUSY_MASK)

/*!
 * @brief I2C error detected
 *        I2C 控制器错误标志，目标地址或发送数据未应答时置位。
 *
 * The error can be from the target address not being acknowledged or the
 * transmit data not being acknowledged
 */
#define DL_I2C_CONTROLLER_STATUS_ERROR                       (I2C_MSR_ERR_MASK)

/*!
 * @brief I2C address acknowledged
 *        I2C 控制器地址应答标志，目标地址被应答时置位。
 */
#define DL_I2C_CONTROLLER_STATUS_ADDR_ACK                 (I2C_MSR_ADRACK_MASK)

/*!
 * @brief I2C data acknowledged
 *        I2C 控制器数据应答标志，发送的数据被应答时置位。
 */
#define DL_I2C_CONTROLLER_STATUS_DATA_ACK                 (I2C_MSR_DATACK_MASK)

/*!
 * @brief I2C arbitration lost
 *        I2C 控制器仲裁丢失标志，多控制器竞争时丢失总线控制权时置位。
 */
#define DL_I2C_CONTROLLER_STATUS_ARBITRATION_LOST         (I2C_MSR_ARBLST_MASK)

/*!
 * @brief I2C idle
 *        I2C 控制器空闲标志，无活跃事务时置位。
 */
#define DL_I2C_CONTROLLER_STATUS_IDLE                       (I2C_MSR_IDLE_MASK)

/*!
 * @brief I2C bus busy
 *        I2C 总线忙标志，根据 START 和 STOP 条件自动变化。
 *
 * The bit changes based on the START and STOP conditions
 */
#define DL_I2C_CONTROLLER_STATUS_BUSY_BUS                 (I2C_MSR_BUSBSY_MASK)

/** @}*/


/** @addtogroup DL_I2C_TARGET_STATUS
 *  @{
 */

/*!
 * @brief Indicates the address for which target address match happened
 *        目标地址匹配标志，指示匹配到的目标地址。
 */
#define DL_I2C_TARGET_STATUS_ADDRESS_MATCH             (I2C_SSR_ADDRMATCH_MASK)

/*!
 * @brief I2C Target Stale TX FIFO
 *        目标 TX FIFO 数据过期标志，上一次事务未清空 FIFO 时置位。
 *
 * Set = The target TX FIFO data is stale. This occurs when the TX FIFO was not
 *   emptied during the previous I2C transaction
 * Clear = The target TX FIFO data is not stale
 */
#define DL_I2C_TARGET_STATUS_STALE_TX_FIFO          (I2C_SSR_STALE_TXFIFO_MASK)

/*!
 * @brief I2C Target TX Mode
 *        目标发送模式标志，目标处于 TX_DATA/TX_ACK/TX_WAIT/ADDR_ACK 状态且总线方向为读时置位。
 *
 * Set = Target is in the TX_DATA, TX_ACK, TX_WAIT, or ADDR_ACK state with the
 *   bus direction set to read
 * Clear = Target is not in the TX_DATA, TX_ACK, TX_WAIT, or ADDR_ACK state
 *   with the bus direction set to read
 */
#define DL_I2C_TARGET_STATUS_TX_MODE                      (I2C_SSR_TXMODE_MASK)

/*!
 * @brief I2C Target Bus Busy
 *        目标总线忙标志，总线活跃时置位，检测到 STOP 或超时时清除。
 *
 * Set = The I2C bus is busy. This is cleared on a timeout
 * Clear = The I2C bus is not busy. This bit is cleared when a STOP condition is
 *   detected on the bus.
 */
#define DL_I2C_TARGET_STATUS_BUS_BUSY                     (I2C_SSR_BUSBSY_MASK)

/*!
 * @brief I2C Target RX Mode
 *        目标接收模式标志，目标处于 RX_DATA/RX_ACK/RX_WAIT/RX_ACK_WAIT/ADDR_ACK 状态且总线方向为写时置位。
 *
 * Set = Target is in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK
 *   state with the bus direction set to write
 * Clear = Target is not in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK
 *   state with the bus direction set to write
 */
#define DL_I2C_TARGET_STATUS_RX_MODE                      (I2C_SSR_RXMODE_MASK)


/*!
 * @brief Direction of I2C Quick Command
 *        I2C 快速命令方向标志，仅在 QCMDST 置位时有效。置位表示读，清除表示写。
 * Only valid when QCMDST is set. @sa DL_I2C_TARGET_STATUS_QUICK_COMMAND_STATUS.
 * Set = Quick command was a read
 * Clear = Quick command was a write
 */
#define DL_I2C_TARGET_STATUS_QUICK_COMMAND_READ_WRITE     (I2C_SSR_QCMDRW_MASK)

/*!
 * @brief Status of I2C Quick Command
 *        I2C 快速命令状态标志，上次事务为快速命令时置位。
 * @sa DL_I2C_TARGET_STATUS_QUICK_COMMAND_READ_WRITE.
 * Set = Last transaction was a Quick Comand transaction
 * Clear = Last transaction was normal or has not occurred
 */
#define DL_I2C_TARGET_STATUS_QUICK_COMMAND_STATUS         (I2C_SSR_QCMDST_MASK)

/*!
 * @brief I2C Target Own Address Alternate Matched
 *        目标备用地址匹配标志，匹配到备用地址（OAR2）时置位。
 */
#define DL_I2C_TARGET_STATUS_OWN_ADDR_ALTERNATE_MATCHED  (I2C_SSR_OAR2SEL_MASK)

/*!
 * @brief I2C Target Transmit Request
 *        目标发送请求标志，控制器发起读操作时置位，目标应准备发送数据。
 */
#define DL_I2C_TARGET_STATUS_TRANSMIT_REQUEST               (I2C_SSR_TREQ_MASK)

/*!
 * @brief I2C Target Receive Request
 *        目标接收请求标志，控制器发起写操作时置位，目标可读取接收数据。
 */
#define DL_I2C_TARGET_STATUS_RECEIVE_REQUEST                (I2C_SSR_RREQ_MASK)

/** @}*/

