zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
/** @addtogroup DL_I2C_INTERRUPT
 *  @{
 */
/*!
 * @brief Controller Receive Transaction completed Interrupt
 *        控制器接收事务完成中断。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_RX_DONE  (I2C_CPU_INT_IMASK_MRXDONE_SET)

/*!
 * @brief Controller Transmit Transaction completed Interrupt
 *        控制器发送事务完成中断。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_TX_DONE  (I2C_CPU_INT_IMASK_MTXDONE_SET)

/*!
 * @brief Controller Receive FIFO Trigger when >= defined bytes
 *        控制器 RX FIFO 触发中断，数据量达到阈值时触发。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER                            \
                                          (I2C_CPU_INT_IMASK_MRXFIFOTRG_SET)

/*!
 * @brief Controller Transmit FIFO Trigger when <= defined bytes
 *        控制器 TX FIFO 触发中断，数据量降至阈值时触发。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER                            \
                                          (I2C_CPU_INT_IMASK_MTXFIFOTRG_SET)

/*!
 * @brief Controller Receive FIFO is full
 *        控制器 RX FIFO 满中断。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_RXFIFO_FULL                               \
                                         (I2C_CPU_INT_IMASK_MRXFIFOFULL_SET)

/*!
 * @brief Controller Transmit FIFO is empty
 *        控制器 TX FIFO 空中断。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_EMPTY                              \
                                            (I2C_CPU_INT_IMASK_MTXEMPTY_SET)

/*!
 * @brief Address/Data NACK Interrupt
 *        地址/数据无应答（NACK）中断。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_NACK       (I2C_CPU_INT_IMASK_MNACK_SET)

/*!
 * @brief START Detection Interrupt
 *        控制器 START 条件检测中断。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_START     (I2C_CPU_INT_IMASK_MSTART_SET)

/*!
 * @brief STOP Detection Interrupt
 *        控制器 STOP 条件检测中断。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_STOP       (I2C_CPU_INT_IMASK_MSTOP_SET)

/*!
 * @brief Arbitration Lost Interrupt
 *        控制器仲裁丢失中断。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_ARBITRATION_LOST                          \
                                            (I2C_CPU_INT_IMASK_MARBLOST_SET)

/*!
 * @brief Controller DMA Done on Event 1 publisher
 *        控制器 DMA 事件 1 完成中断（TX DMA 完成）。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_EVENT1_DMA_DONE                           \
                                       (I2C_CPU_INT_IMASK_MDMA_DONE_TX_SET)

/*!
 * @brief Controller DMA Done on Event 2 publisher
 *        控制器 DMA 事件 2 完成中断（RX DMA 完成）。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_EVENT2_DMA_DONE                           \
                                       (I2C_CPU_INT_IMASK_MDMA_DONE_RX_SET)


/*!
 * @brief Controller SMBus/PMBus PEC Receive Error Interrupt
 *        控制器 SMBus/PMBus PEC 接收错误中断。
 */
#define DL_I2C_INTERRUPT_CONTROLLER_PEC_RX_ERROR                              \
                                         (I2C_CPU_INT_IMASK_MPEC_RX_ERR_SET)


/*!
 * @brief Target Receive Data Interrupt (byte has been received)
 *        目标接收数据完成中断（收到 1 字节）。
 */
#define DL_I2C_INTERRUPT_TARGET_RX_DONE      (I2C_CPU_INT_IMASK_SRXDONE_SET)

/*!
 * @brief Target Transmit Transaction completed Interrupt
 *        目标发送事务完成中断。
 */
#define DL_I2C_INTERRUPT_TARGET_TX_DONE      (I2C_CPU_INT_IMASK_STXDONE_SET)

/*!
 * @brief Target Receive FIFO Trigger
 *        目标 RX FIFO 触发中断，数据量达到阈值时触发。
 */
#define DL_I2C_INTERRUPT_TARGET_RXFIFO_TRIGGER                                \
                                          (I2C_CPU_INT_IMASK_SRXFIFOTRG_SET)

/*!
 * @brief Target Transmit FIFO Trigger
 *        目标 TX FIFO 触发中断，数据量降至阈值时触发。
 */
#define DL_I2C_INTERRUPT_TARGET_TXFIFO_TRIGGER                                \
                                          (I2C_CPU_INT_IMASK_STXFIFOTRG_SET)

/*!
 * @brief Target RX FIFO full
 *        目标 RX FIFO 满中断。
 */
#define DL_I2C_INTERRUPT_TARGET_RXFIFO_FULL                                   \
                                         (I2C_CPU_INT_IMASK_SRXFIFOFULL_SET)

/*!
 * @brief Target TX FIFO empty. All data in Transmit FIFO shifted out and
 * transmit goes into idle mode.
 *        目标 TX FIFO 空中断，所有数据移出后发送进入空闲。
 */
#define DL_I2C_INTERRUPT_TARGET_TXFIFO_EMPTY                                  \
                                            (I2C_CPU_INT_IMASK_STXEMPTY_SET)

/*!
 * @brief Target Start Condition detected
 *        目标 START 条件检测中断。
 */
#define DL_I2C_INTERRUPT_TARGET_START                                         \
                                              (I2C_CPU_INT_IMASK_SSTART_SET)

/*!
 * @brief Target Stop Condition detected
 *        目标 STOP 条件检测中断。
 */
#define DL_I2C_INTERRUPT_TARGET_STOP           (I2C_CPU_INT_IMASK_SSTOP_SET)

/*!
 * @brief General Call Interrupt
 *        目标通用呼叫（General Call）中断。
 */
#define DL_I2C_INTERRUPT_TARGET_GENERAL_CALL                                  \
                                            (I2C_CPU_INT_IMASK_SGENCALL_SET)

/*!
 * @brief Target DMA Done on Event 1 Publisher
 *        目标 DMA 事件 1 完成中断（TX DMA 完成）。
 */
#define DL_I2C_INTERRUPT_TARGET_EVENT1_DMA_DONE                               \
                                        (I2C_CPU_INT_IMASK_SDMA_DONE_TX_SET)

/*!
 * @brief Target DMA Done on Event 2 Publisher
 *        目标 DMA 事件 2 完成中断（RX DMA 完成）。
 */
#define DL_I2C_INTERRUPT_TARGET_EVENT2_DMA_DONE                               \
                                        (I2C_CPU_INT_IMASK_SDMA_DONE_RX_SET)


/*!
 * @brief Target SMBus/PMBus PEC Receive Error Interrupt
 *        目标 SMBus/PMBus PEC 接收错误中断。
 */
#define DL_I2C_INTERRUPT_TARGET_PEC_RX_ERROR                                  \
                                         (I2C_CPU_INT_IMASK_SPEC_RX_ERR_SET)

/*!
 * @brief Target TX FIFO Underflow Interrupt
 *        目标 TX FIFO 下溢中断。
 */
#define DL_I2C_INTERRUPT_TARGET_TXFIFO_UNDERFLOW                              \
                                            (I2C_CPU_INT_IMASK_STX_UNFL_SET)

/*!
 * @brief Target RX FIFO Overflow Interrupt
 *        目标 RX FIFO 溢出中断。
 */
#define DL_I2C_INTERRUPT_TARGET_RXFIFO_OVERFLOW                              \
                                            (I2C_CPU_INT_IMASK_SRX_OVFL_SET)

/*!
 * @brief Target Arbitration Lost Interrupt
 *        目标仲裁丢失中断。
 */
#define DL_I2C_INTERRUPT_TARGET_ARBITRATION_LOST                              \
                                            (I2C_CPU_INT_IMASK_SARBLOST_SET)

/*!
 * @brief Interrupt Overflow Interrupt. Occurs when Target START or STOP
 *        interrupts overflow (i.e. occurs twice without being serviced)
 *        中断溢出中断，目标 START 或 STOP 中断连续发生两次未被服务时触发。
 */
#define DL_I2C_TARGET_INTERRUPT_OVERFLOW   (I2C_CPU_INT_IMASK_INTR_OVFL_SET)

/*!
 * @brief Timeout A Interrupt
 *        超时 A 中断，SCL 低电平超时时触发。
 */
#define DL_I2C_INTERRUPT_TIMEOUT_A          (I2C_CPU_INT_IMASK_TIMEOUTA_SET)

/*!
 * @brief Timeout B Interrupt
 *        超时 B 中断，SCL 高电平超时时触发。
 */
#define DL_I2C_INTERRUPT_TIMEOUT_B          (I2C_CPU_INT_IMASK_TIMEOUTB_SET)


/** @}*/

/** @addtogroup DL_I2C_DMA_INTERRUPT
 *  @{
 */
/*!
 * @brief Peripheral Transmit FIFO Trigger interrupt for DMA trigger
 *        目标 TX FIFO 触发 DMA 中断。
 */
#define DL_I2C_DMA_INTERRUPT_TARGET_TXFIFO_TRIGGER                            \
                                          (I2C_DMA_TRIG1_IMASK_STXFIFOTRG_SET)

/*!
 * @brief Peripheral Receive FIFO Trigger interrupt for DMA trigger
 *        目标 RX FIFO 触发 DMA 中断。
 */
#define DL_I2C_DMA_INTERRUPT_TARGET_RXFIFO_TRIGGER                            \
                                          (I2C_DMA_TRIG1_IMASK_SRXFIFOTRG_SET)

/*!
 * @brief Controller Transmit FIFO Trigger when <= defined bytes for DMA trigger
 *        控制器 TX FIFO 触发 DMA 中断。
 */
#define DL_I2C_DMA_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER                        \
                                          (I2C_DMA_TRIG1_IMASK_MTXFIFOTRG_SET)

/*!
 * @brief Controller Receive FIFO Trigger when >= defined bytes for DMA trigger
 *        控制器 RX FIFO 触发 DMA 中断。
 */
#define DL_I2C_DMA_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER                        \
                                          (I2C_DMA_TRIG1_IMASK_MRXFIFOTRG_SET)

/** @}*/

/*!
 * @brief Backwards compatible redirect for @ref DL_I2C_getTargetOwnAddressAlternateMask
*/
#define I2C_getTargetOwnAddressAlternateMask DL_I2C_getTargetOwnAddressAlternateMask

    /* clang-format on */

    /*! @enum DL_I2C_DMA_IIDX I2C DMA 触发中断索引 */
    typedef enum
    {
        /*! I2C interrupt index for enabling I2C Target Transmit FIFO Trigger as DMA trigger
         *  目标 TX FIFO 触发 DMA 的中断索引 */
        DL_I2C_DMA_IIDX_TARGET_TXFIFO_TRIGGER = I2C_DMA_TRIG1_IIDX_STAT_MTXFIFOTRG,
        /*! I2C interrupt index for enabling I2C Target Receive FIFO Trigger as DMA trigger
         *  目标 RX FIFO 触发 DMA 的中断索引 */
        DL_I2C_DMA_IIDX_TARGET_RXFIFO_TRIGGER = I2C_DMA_TRIG1_IIDX_STAT_MRXFIFOTRG,
        /*! I2C interrupt index for enabling I2C Controller Transmit FIFO Trigger as DMA trigger
         *  控制器 TX FIFO 触发 DMA 的中断索引 */
        DL_I2C_DMA_IIDX_CONTROLLER_TXFIFO_TRIGGER =
            I2C_DMA_TRIG1_IIDX_STAT_STXFIFOTRG,
        /*! I2C interrupt index for enabling I2C Controller Receive FIFO Trigger as DMA trigger
         *  控制器 RX FIFO 触发 DMA 的中断索引 */
        DL_I2C_DMA_IIDX_CONTROLLER_RXFIFO_TRIGGER =
            I2C_DMA_TRIG1_IIDX_STAT_SRXFIFOTRG
    } DL_I2C_DMA_IIDX;

    /** @enum DL_I2C_EVENT_ROUTE I2C 事件路由选择 */
    typedef enum
    {
        /*! I2C event route 1 事件路由 1 */
        DL_I2C_EVENT_ROUTE_1 = 0,
        /*! I2C event route 2 事件路由 2 */
        DL_I2C_EVENT_ROUTE_2 = 12
    } DL_I2C_EVENT_ROUTE;

    /** @enum DL_I2C_CLOCK I2C 时钟源选择 */
    typedef enum
    {
        /*!  BUSCLK enabled as I2C clock source 总线时钟作为 I2C 时钟源 */
        DL_I2C_CLOCK_BUSCLK = I2C_CLKSEL_BUSCLK_SEL_ENABLE,
        /*!  MFCLK enabled as I2C clock source 主功能时钟作为 I2C 时钟源 */
        DL_I2C_CLOCK_MFCLK = I2C_CLKSEL_MFCLK_SEL_ENABLE,
    } DL_I2C_CLOCK;

    /** @enum DL_I2C_CLOCK_DIVIDE I2C 时钟分频比 */
    typedef enum
    {
        /*!  I2C Clock Divided by 1 不分频 */
        DL_I2C_CLOCK_DIVIDE_1 = I2C_CLKDIV_RATIO_DIV_BY_1,
        /*!  I2C Clock Divided by 2 2 分频 */
        DL_I2C_CLOCK_DIVIDE_2 = I2C_CLKDIV_RATIO_DIV_BY_2,
        /*!  I2C Clock Divided by 3 3 分频 */
        DL_I2C_CLOCK_DIVIDE_3 = I2C_CLKDIV_RATIO_DIV_BY_3,
        /*!  I2C Clock Divided by 4 4 分频 */
        DL_I2C_CLOCK_DIVIDE_4 = I2C_CLKDIV_RATIO_DIV_BY_4,
        /*!  I2C Clock Divided by 5 5 分频 */
        DL_I2C_CLOCK_DIVIDE_5 = I2C_CLKDIV_RATIO_DIV_BY_5,
        /*!  I2C Clock Divided by 6 6 分频 */
        DL_I2C_CLOCK_DIVIDE_6 = I2C_CLKDIV_RATIO_DIV_BY_6,
        /*!  I2C Clock Divided by 7 7 分频 */
        DL_I2C_CLOCK_DIVIDE_7 = I2C_CLKDIV_RATIO_DIV_BY_7,
        /*!  I2C Clock Divided by 8 8 分频 */
        DL_I2C_CLOCK_DIVIDE_8 = I2C_CLKDIV_RATIO_DIV_BY_8,
    } DL_I2C_CLOCK_DIVIDE;

    /** @enum DL_I2C_TARGET_ADDRESSING_MODE 目标寻址模式 */
    typedef enum
    {
        /*! Enable Target in 7-bit addressing mode 7 位寻址模式 */
        DL_I2C_TARGET_ADDRESSING_MODE_7_BIT = I2C_SOAR_SMODE_MODE7,
        /*! Enable Target in 10-bit addressing mode 10 位寻址模式 */
        DL_I2C_TARGET_ADDRESSING_MODE_10_BIT = I2C_SOAR_SMODE_MODE10,
    } DL_I2C_TARGET_ADDRESSING_MODE;

