zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
    /** @enum DL_I2C_TARGET_PEC_STATUS 目标 PEC 校验状态 */
    typedef enum
    {
        /*!  I2C Target SMBus/PMBus PEC was checked in the transaction that occurred
         *   before the last Stop 上次事务已执行 PEC 校验 */
        DL_I2C_TARGET_PEC_STATUS_CHECKED = I2C_TARGET_PECSR_PECSTS_CHECK_SET,
        /*!  I2C Target SMBus/PMBus PEC was not checked in the transaction that
         *   occurred before the last Stop 上次事务未执行 PEC 校验 */
        DL_I2C_TARGET_PEC_STATUS_NOT_CHECKED =
            I2C_TARGET_PECSR_PECSTS_CHECK_CLEARED,
    } DL_I2C_TARGET_PEC_STATUS;

    /** @enum DL_I2C_TARGET_PEC_CHECK_ERROR 目标 PEC 校验错误状态 */
    typedef enum
    {
        /*!  Indicates PEC check error did not occurr in the transaction that
         *   occurred before the last Stop 上次事务 PEC 校验无错误 */
        DL_I2C_TARGET_PEC_CHECK_ERROR_CLEARED =
            I2C_TARGET_PECSR_PECSTS_ERROR_CLEARED,
        /*!  Indicates PEC check error occurred in the transaction that
         *   occurred before the last Stop 上次事务 PEC 校验出错 */
        DL_I2C_TARGET_PEC_CHECK_ERROR_SET = I2C_TARGET_PECSR_PECSTS_ERROR_SET,
    } DL_I2C_TARGET_PEC_CHECK_ERROR;

    /** @enum DL_I2C_ANALOG_GLITCH_FILTER_WIDTH 模拟毛刺滤波宽度 */
    typedef enum
    {
        /*!  Pulses shorter than 5ns in length are filtered. 滤除 5ns 以下脉冲 */
        DL_I2C_ANALOG_GLITCH_FILTER_WIDTH_5NS = I2C_GFCTL_AGFSEL_AGLIT_5,
        /*!  Pulses shorter than 10ns in length are filtered. 滤除 10ns 以下脉冲 */
        DL_I2C_ANALOG_GLITCH_FILTER_WIDTH_10NS = I2C_GFCTL_AGFSEL_AGLIT_10,
        /*!  Pulses shorter than 25ns in length are filtered. 滤除 25ns 以下脉冲 */
        DL_I2C_ANALOG_GLITCH_FILTER_WIDTH_25NS = I2C_GFCTL_AGFSEL_AGLIT_25,
        /*!  Pulses shorter than 50ns in length are filtered. 滤除 50ns 以下脉冲 */
        DL_I2C_ANALOG_GLITCH_FILTER_WIDTH_50NS = I2C_GFCTL_AGFSEL_AGLIT_50,
    } DL_I2C_ANALOG_GLITCH_FILTER_WIDTH;

    /** @enum DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH 数字毛刺滤波宽度 */
    typedef enum
    {
        /*!  Pulses filtering disabled. 禁用数字毛刺滤波 */
        DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_DISABLED = I2C_GFCTL_DGFSEL_DISABLED,
        /*!  Pulses shorter than 1 functional clock tick in length are filtered. 滤除 1 个时钟周期以下脉冲 */
        DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_1 = I2C_GFCTL_DGFSEL_CLK_1,
        /*!  Pulses shorter than 2 functional clock ticks in length are filtered. 滤除 2 个时钟周期以下脉冲 */
        DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_2 = I2C_GFCTL_DGFSEL_CLK_2,
        /*!  Pulses shorter than 3 functional clock ticks in length are filtered. 滤除 3 个时钟周期以下脉冲 */
        DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_3 = I2C_GFCTL_DGFSEL_CLK_3,
        /*!  Pulses shorter than 4 functional clock ticks in length are filtered. 滤除 4 个时钟周期以下脉冲 */
        DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_4 = I2C_GFCTL_DGFSEL_CLK_4,
        /*!  Pulses shorter than 8 functional clock ticks in length are filtered. 滤除 8 个时钟周期以下脉冲 */
        DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_8 = I2C_GFCTL_DGFSEL_CLK_8,
        /*!  Pulses shorter than 16 functional clock ticks in length are filtered. 滤除 16 个时钟周期以下脉冲 */
        DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_16 = I2C_GFCTL_DGFSEL_CLK_16,
        /*!  Pulses shorter than 31 functional clock ticks in length are filtered. 滤除 31 个时钟周期以下脉冲 */
        DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_31 = I2C_GFCTL_DGFSEL_CLK_31,
    } DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH;

    /** @enum DL_I2C_CONTROLLER_DIRECTION 控制器传输方向 */
    typedef enum
    {
        /*! Set direction to controller transmitting to target 控制器发送方向 */
        DL_I2C_CONTROLLER_DIRECTION_TX = I2C_MSA_DIR_TRANSMIT,
        /*! Set direction to controller receiving from target 控制器接收方向 */
        DL_I2C_CONTROLLER_DIRECTION_RX = I2C_MSA_DIR_RECEIVE,
    } DL_I2C_CONTROLLER_DIRECTION;

    /** @enum DL_I2C_CONTROLLER_ADDRESSING_MODE 控制器寻址模式 */
    typedef enum
    {
        /*! Enable Controller in 7-bit addressing mode 7 位寻址模式 */
        DL_I2C_CONTROLLER_ADDRESSING_MODE_7_BIT = I2C_MSA_MMODE_MODE7,
        /*! Enable Controller in 10-bit addressing mode 10 位寻址模式 */
        DL_I2C_CONTROLLER_ADDRESSING_MODE_10_BIT = I2C_MSA_MMODE_MODE10,
    } DL_I2C_CONTROLLER_ADDRESSING_MODE;

    /** @enum DL_I2C_CONTROLLER_PEC_STATUS 控制器 PEC 校验状态 */
    typedef enum
    {
        /*!  I2C Controller SMBus/PMBus PEC was checked in the transaction that
         *   occurred before the last Stop 上次事务已执行 PEC 校验 */
        DL_I2C_CONTROLLER_PEC_STATUS_CHECKED =
            I2C_CONTROLLER_PECSR_PECSTS_CHECK_SET,
        /*!  I2C Controller SMBus/PMBus PEC was not checked in the transaction that
         *   occurred the last Stop 上次事务未执行 PEC 校验 */
        DL_I2C_CONTROLLER_PEC_STATUS_NOT_CHECKED =
            I2C_CONTROLLER_PECSR_PECSTS_CHECK_CLEARED,
    } DL_I2C_CONTROLLER_PEC_STATUS;

    /** @enum DL_I2C_CONTROLLER_PEC_CHECK_ERROR 控制器 PEC 校验错误状态 */
    typedef enum
    {
        /*! I2C Controller SMBus/PMBus PEC check error occurred in the transaction
         *  before the last stop 上次事务 PEC 校验出错 */
        DL_I2C_CONTROLLER_PEC_CHECK_ERROR_SET =
            I2C_CONTROLLER_PECSR_PECSTS_ERROR_SET,
        /*! I2C Controller SMBus/PMBus PEC check error did not occur in the
         *  transaction before the last stop 上次事务 PEC 校验无错误 */
        DL_I2C_CONTROLLER_PEC_CHECK_ERROR_CLEARED =
            I2C_CONTROLLER_PECSR_PECSTS_ERROR_CLEARED,
    } DL_I2C_CONTROLLER_PEC_CHECK_ERROR;

    /** @enum DL_I2C_CONTROLLER_SCL 控制器 SCL 信号状态 */
    typedef enum
    {
        /*!  I2C SCL signal high SCL 信号高电平 */
        DL_I2C_CONTROLLER_SCL_HIGH = I2C_MBMON_SCL_SET,
        /*!  I2C SCL signal low SCL 信号低电平 */
        DL_I2C_CONTROLLER_SCL_LOW = I2C_MBMON_SCL_CLEARED,
    } DL_I2C_CONTROLLER_SCL;

    /** @enum DL_I2C_CONTROLLER_SDA 控制器 SDA 信号状态 */
    typedef enum
    {
        /*!  I2C SDA signal high SDA 信号高电平 */
        DL_I2C_CONTROLLER_SDA_HIGH = I2C_MBMON_SDA_SET,
        /*!  I2C SDA signal low SDA 信号低电平 */
        DL_I2C_CONTROLLER_SDA_LOW = I2C_MBMON_SDA_CLEARED,
    } DL_I2C_CONTROLLER_SDA;

    /** @enum DL_I2C_CONTROLLER_START 控制器 START 条件生成 */
    typedef enum
    {
        /*!  Controller generates START condition 生成 START 条件 */
        DL_I2C_CONTROLLER_START_ENABLE = I2C_MCTR_START_ENABLE,
        /*!  Controller doesn't generate START condition 不生成 START 条件 */
        DL_I2C_CONTROLLER_START_DISABLE = I2C_MCTR_START_DISABLE,
    } DL_I2C_CONTROLLER_START;

    /** @enum DL_I2C_CONTROLLER_STOP 控制器 STOP 条件生成 */
    typedef enum
    {
        /*!  Controller generates STOP condition 生成 STOP 条件 */
        DL_I2C_CONTROLLER_STOP_ENABLE = I2C_MCTR_STOP_ENABLE,
        /*!  Controller doesn't generate STOP condition 不生成 STOP 条件 */
        DL_I2C_CONTROLLER_STOP_DISABLE = I2C_MCTR_STOP_DISABLE,
    } DL_I2C_CONTROLLER_STOP;

