zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
    /** @enum DL_I2C_CONTROLLER_ACK 控制器应答控制 */
    typedef enum
    {
        /*!  Last received data byte of a transaction is not ACKed automatically 最后一字节不自动应答（由软件控制） */
        DL_I2C_CONTROLLER_ACK_ENABLE = I2C_MCTR_ACK_ENABLE,
        /*!  Last received data byte of a transaction is ACKed automatically 最后一字节自动应答 */
        DL_I2C_CONTROLLER_ACK_DISABLE = I2C_MCTR_ACK_DISABLE,
    } DL_I2C_CONTROLLER_ACK;

    /** @enum DL_I2C_TX_FIFO_LEVEL TX FIFO 触发阈值 */
    typedef enum
    {
        /*!  Trigger when the TX FIFO is empty FIFO 空时触发 */
        DL_I2C_TX_FIFO_LEVEL_EMPTY = I2C_MFIFOCTL_TXTRIG_EMPTY,
        /*!  Trigger when TX FIFO contains 1 byte FIFO 含 1 字节时触发 */
        DL_I2C_TX_FIFO_LEVEL_BYTES_1 = I2C_MFIFOCTL_TXTRIG_LEVEL_1,
        /*!  Trigger when TX FIFO contains 2 bytes FIFO 含 2 字节时触发 */
        DL_I2C_TX_FIFO_LEVEL_BYTES_2 = I2C_MFIFOCTL_TXTRIG_LEVEL_2,
        /*!  Trigger when TX FIFO contains 3 bytes FIFO 含 3 字节时触发 */
        DL_I2C_TX_FIFO_LEVEL_BYTES_3 = I2C_MFIFOCTL_TXTRIG_LEVEL_3,
        /*!  Trigger when TX FIFO contains 4 bytes FIFO 含 4 字节时触发 */
        DL_I2C_TX_FIFO_LEVEL_BYTES_4 = I2C_MFIFOCTL_TXTRIG_LEVEL_4,
        /*!  Trigger when TX FIFO contains 5 bytes FIFO 含 5 字节时触发 */
        DL_I2C_TX_FIFO_LEVEL_BYTES_5 = I2C_MFIFOCTL_TXTRIG_LEVEL_5,
        /*!  Trigger when TX FIFO contains 6 bytes FIFO 含 6 字节时触发 */
        DL_I2C_TX_FIFO_LEVEL_BYTES_6 = I2C_MFIFOCTL_TXTRIG_LEVEL_6,
        /*!  Trigger when TX FIFO contains 7 bytes FIFO 含 7 字节时触发 */
        DL_I2C_TX_FIFO_LEVEL_BYTES_7 = I2C_MFIFOCTL_TXTRIG_LEVEL_7,
    } DL_I2C_TX_FIFO_LEVEL;

    /** @enum DL_I2C_RX_FIFO_LEVEL RX FIFO 触发阈值 */
    typedef enum
    {
        /*!  Trigger when RX FIFO contains at least 1 byte FIFO 至少含 1 字节时触发 */
        DL_I2C_RX_FIFO_LEVEL_BYTES_1 = I2C_MFIFOCTL_RXTRIG_LEVEL_1,
        /*!  Trigger when RX FIFO contains at least 2 bytes FIFO 至少含 2 字节时触发 */
        DL_I2C_RX_FIFO_LEVEL_BYTES_2 = I2C_MFIFOCTL_RXTRIG_LEVEL_2,
        /*!  Trigger when RX FIFO contains at least 3 bytes FIFO 至少含 3 字节时触发 */
        DL_I2C_RX_FIFO_LEVEL_BYTES_3 = I2C_MFIFOCTL_RXTRIG_LEVEL_3,
        /*!  Trigger when RX FIFO contains at least 4 bytes FIFO 至少含 4 字节时触发 */
        DL_I2C_RX_FIFO_LEVEL_BYTES_4 = I2C_MFIFOCTL_RXTRIG_LEVEL_4,
        /*!  Trigger when RX FIFO contains at least 5 bytes FIFO 至少含 5 字节时触发 */
        DL_I2C_RX_FIFO_LEVEL_BYTES_5 = I2C_MFIFOCTL_RXTRIG_LEVEL_5,
        /*!  Trigger when RX FIFO contains at least 6 bytes FIFO 至少含 6 字节时触发 */
        DL_I2C_RX_FIFO_LEVEL_BYTES_6 = I2C_MFIFOCTL_RXTRIG_LEVEL_6,
        /*!  Trigger when RX FIFO contains at least 7 bytes FIFO 至少含 7 字节时触发 */
        DL_I2C_RX_FIFO_LEVEL_BYTES_7 = I2C_MFIFOCTL_RXTRIG_LEVEL_7,
        /*!  Trigger when RX FIFO contains at least 8 bytes FIFO 至少含 8 字节时触发 */
        DL_I2C_RX_FIFO_LEVEL_BYTES_8 = I2C_MFIFOCTL_RXTRIG_LEVEL_8,
    } DL_I2C_RX_FIFO_LEVEL;

    /** @enum DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE 目标应答覆盖值 */
    typedef enum
    {
        /*!  Target manual ACK for valid data or command. 手动应答 ACK */
        DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE_ACK = I2C_SACKCTL_ACKOVAL_DISABLE,
        /*!  Target manual NACK for invalid data or command. 手动应答 NACK */
        DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE_NACK = I2C_SACKCTL_ACKOVAL_ENABLE,
    } DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE;

    /*! @enum DL_I2C_IIDX I2C 中断索引 */
    typedef enum
    {
        /*! Interrupt index for I2C if no interrupt is pending 无中断挂起 */
        DL_I2C_IIDX_NO_INT = I2C_CPU_INT_IIDX_STAT_NO_INTR,
        /*! Interrupt index for I2C Controller Receive Transaction completed 控制器接收完成 */
        DL_I2C_IIDX_CONTROLLER_RX_DONE = I2C_CPU_INT_IIDX_STAT_MRXDONEFG,
        /*! Interrupt index for Controller Transmit Transaction completed 控制器发送完成 */
        DL_I2C_IIDX_CONTROLLER_TX_DONE = I2C_CPU_INT_IIDX_STAT_MTXDONEFG,
        /*! Interrupt index for I2C Controller Receive FIFO Trigger 控制器 RX FIFO 触发 */
        DL_I2C_IIDX_CONTROLLER_RXFIFO_TRIGGER = I2C_CPU_INT_IIDX_STAT_MRXFIFOTRG,
        /*! Interrupt index for I2C Controller Transmit FIFO Trigger 控制器 TX FIFO 触发 */
        DL_I2C_IIDX_CONTROLLER_TXFIFO_TRIGGER = I2C_CPU_INT_IIDX_STAT_MTXFIFOTRG,
        /*! Interrupt index for I2C Controller Receive when FIFO is full 控制器 RX FIFO 满 */
        DL_I2C_IIDX_CONTROLLER_RXFIFO_FULL = I2C_CPU_INT_IIDX_STAT_MRXFIFOFULL,
        /*! Interrupt index for I2C Controller when Transmit FIFO is empty 控制器 TX FIFO 空 */
        DL_I2C_IIDX_CONTROLLER_TXFIFO_EMPTY = I2C_CPU_INT_IIDX_STAT_MTX_EMPTY,
        /*! Interrupt index for Address/Data NACK 地址/数据无应答 */
        DL_I2C_IIDX_CONTROLLER_NACK = I2C_CPU_INT_IIDX_STAT_MNACKFG,
        /*! Interrupt index for I2C controller START Detection 控制器 START 检测 */
        DL_I2C_IIDX_CONTROLLER_START = I2C_CPU_INT_IIDX_STAT_MSTARTFG,
        /*! Interrupt index for I2C controller STOP Detection 控制器 STOP 检测 */
        DL_I2C_IIDX_CONTROLLER_STOP = I2C_CPU_INT_IIDX_STAT_MSTOPFG,
        /*! Interrupt index for I2C controller Arbitration Lost 控制器仲裁丢失 */
        DL_I2C_IIDX_CONTROLLER_ARBITRATION_LOST = I2C_CPU_INT_IIDX_STAT_MARBLOSTFG,
        /*! Interrupt index for I2C controller Event 1 DMA Done 控制器 DMA 事件 1 完成 */
        DL_I2C_IIDX_CONTROLLER_EVENT1_DMA_DONE =
            I2C_CPU_INT_IIDX_STAT_MDMA_DONE_TX,
        /*! Interrupt index for I2C controller Event 2 DMA Done 控制器 DMA 事件 2 完成 */
        DL_I2C_IIDX_CONTROLLER_EVENT2_DMA_DONE =
            I2C_CPU_INT_IIDX_STAT_MDMA_DONE_RX,

        /*! Interrupt index for I2C controller SMBus/PMBus PEC Receive Error Event 控制器 PEC 接收错误 */
        DL_I2C_IIDX_CONTROLLER_PEC_RX_ERROR = I2C_CPU_INT_IIDX_STAT_MPEC_RX_ERR,
        /*! Interrupt index for I2C Timeout A Event 超时 A 事件 */
        DL_I2C_IIDX_TIMEOUT_A = I2C_CPU_INT_IIDX_STAT_TIMEOUTA,
        /*! Interrupt index for I2C Timeout B Event 超时 B 事件 */
        DL_I2C_IIDX_TIMEOUT_B = I2C_CPU_INT_IIDX_STAT_TIMEOUTB,

        /*! Interrupt index for I2C Target Receive Data 目标接收数据完成 */
        DL_I2C_IIDX_TARGET_RX_DONE = I2C_CPU_INT_IIDX_STAT_SRXDONEFG,
        /*! Interrupt index for I2C Target Transmit Transaction completed 目标发送完成 */
        DL_I2C_IIDX_TARGET_TX_DONE = I2C_CPU_INT_IIDX_STAT_STXDONEFG,
        /*! Interrupt index for I2C Target Receive FIFO Trigger 目标 RX FIFO 触发 */
        DL_I2C_IIDX_TARGET_RXFIFO_TRIGGER = I2C_CPU_INT_IIDX_STAT_SRXFIFOTRG,
        /*! Interrupt index for I2C Target Transmit FIFO Trigger 目标 TX FIFO 触发 */
        DL_I2C_IIDX_TARGET_TXFIFO_TRIGGER = I2C_CPU_INT_IIDX_STAT_STXFIFOTRG,
        /*! Interrupt index for I2C Target RX FIFO full 目标 RX FIFO 满 */
        DL_I2C_IIDX_TARGET_RXFIFO_FULL = I2C_CPU_INT_IIDX_STAT_SRXFIFOFULL,
        /*! Interrupt index for I2C Target TX FIFO empty.
         * All data in Transmit FIFO shifted out and transmit goes into idle mode.
         * 目标 TX FIFO 空，所有数据移出后发送空闲 */
        DL_I2C_IIDX_TARGET_TXFIFO_EMPTY = I2C_CPU_INT_IIDX_STAT_STXEMPTY,
        /*! Interrupt index for I2C Target Start Condition detected 目标 START 检测 */
        DL_I2C_IIDX_TARGET_START = I2C_CPU_INT_IIDX_STAT_SSTARTFG,
        /*! Interrupt index for I2C Target Stop Condition detected 目标 STOP 检测 */
        DL_I2C_IIDX_TARGET_STOP = I2C_CPU_INT_IIDX_STAT_SSTOPFG,
        /*! Interrupt index for I2C General Call 通用呼叫中断 */
        DL_I2C_IIDX_TARGET_GENERAL_CALL = I2C_CPU_INT_IIDX_STAT_SGENCALL,
        /*! Interrupt index for I2C Target Event 1 DMA Done 目标 DMA 事件 1 完成 */
        DL_I2C_IIDX_TARGET_EVENT1_DMA_DONE = I2C_CPU_INT_IIDX_STAT_SDMA_DONE_TX,
        /*! Interrupt index for I2C Target Event 2 DMA Done 目标 DMA 事件 2 完成 */
        DL_I2C_IIDX_TARGET_EVENT2_DMA_DONE = I2C_CPU_INT_IIDX_STAT_SDMA_DONE_RX,

        /*! Interrupt index for I2C Target SMBus/PMBus PEC Receive Error Event 目标 PEC 接收错误 */
        DL_I2C_IIDX_TARGET_PEC_RX_ERROR = I2C_CPU_INT_IIDX_STAT_SPEC_RX_ERR,
        /*! Interrupt index for I2C Target TX FIFO underflow event 目标 TX FIFO 下溢 */
        DL_I2C_IIDX_TARGET_TXFIFO_UNDERFLOW = I2C_CPU_INT_IIDX_STAT_STX_UNFL,
        /*! Interrupt index for I2C Target RX FIFO overflow event 目标 RX FIFO 溢出 */
        DL_I2C_IIDX_TARGET_RXFIFO_OVERFLOW = I2C_CPU_INT_IIDX_STAT_SRX_OVFL,
        /*! Interrupt index for I2C Target arbitration lost event 目标仲裁丢失 */
        DL_I2C_IIDX_TARGET_ARBITRATION_LOST = I2C_CPU_INT_IIDX_STAT_SARBLOST,
        /*! Interrupt index for I2C interrupt overflow event 中断溢出 */
        DL_I2C_IIDX_INTERRUPT_OVERFLOW = I2C_CPU_INT_IIDX_STAT_INTR_OVFL,

    } DL_I2C_IIDX;

    /**
     * @brief  Configuration struct for @ref DL_I2C_setClockConfig.
     *         I2C 时钟配置结构体。
     */
    typedef struct
    {
        /*! I2C module clock source. One of @ref DL_I2C_CLOCK
         *  I2C 模块时钟源选择 */
        DL_I2C_CLOCK clockSel;
        /*! I2C clock divider selection. One of @ref DL_I2C_CLOCK_DIVIDE
         *  I2C 时钟分频比选择 */
        DL_I2C_CLOCK_DIVIDE divideRatio;
    } DL_I2C_ClockConfig;

    /**
     *  @brief      Configure I2C source clock
     *  @details    功能：配置 I2C 模块的时钟源与分频参数。
     *
     *  @param[in]  i2c    Pointer to the register overlay for the
     *                      peripheral
     *                      参数：I2C 外设寄存器基址。
     *  @param[in]  config  Pointer to the clock configuration struct
     *                       @ref DL_I2C_ClockConfig.
     *                       参数：时钟配置结构体指针。
     *
     *  @return     返回值：无。
     */
    void DL_I2C_setClockConfig(I2C_Regs *i2c, const DL_I2C_ClockConfig *config);

    /**
     *  @brief      Get I2C source clock configuration
     *  @details    功能：读取 I2C 模块当前时钟源与分频参数。
     *
     *  @param[in]  i2c    Pointer to the register overlay for the
     *                      peripheral
     *                      参数：I2C 外设寄存器基址。
     *  @param[in]  config  Pointer to the clock configuration struct
     *                      @ref DL_I2C_ClockConfig.
     *                      参数：用于回填的时钟配置结构体指针。
     *
     *  @return     返回值：无。
     */
    void DL_I2C_getClockConfig(const I2C_Regs *i2c, DL_I2C_ClockConfig *config);

    /**
     *  @brief      Fills the controller TX FIFO with data
     *  @details    功能：将缓存区数据写入控制器 TX FIFO，写满即停止。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      参数：I2C 外设寄存器基址。
     *  @param[in]  buffer  Pointer to buffer of bytes
     *                      参数：待发送数据缓冲区首地址。
     *  @param[in]  count   Number of bytes to fill controller TX FIFO from buffer
     *                      [0x00, 0xFFF]
     *                      参数：期望写入的字节数量。
     *
     *  @return     Number of bytes that were successfully written
     *              返回值：实际成功写入 FIFO 的字节数。
     */
    uint16_t DL_I2C_fillControllerTXFIFO(
        I2C_Regs *i2c, const uint8_t *buffer, uint16_t count);

    /**
     *  @brief      Flushes/removes all elements in the controller TX FIFO
     *  @details    功能：清空控制器 TX FIFO 并等待硬件完成。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      参数：I2C 外设寄存器基址。
     *
     *  @return     返回值：无。
     */
    void DL_I2C_flushControllerTXFIFO(I2C_Regs *i2c);

    /**
     *  @brief      Flushes/removes all elements in the controller RX FIFO
     *  @details    功能：清空控制器 RX FIFO 并等待硬件完成。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      参数：I2C 外设寄存器基址。
     *
     *  @return     返回值：无。
     */
    void DL_I2C_flushControllerRXFIFO(I2C_Regs *i2c);

    /**
     *  @brief      Checks if controller TX FIFO is full
     *              检查控制器 TX FIFO 是否已满。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If controller TX FIFO is full
     *              返回值：`true` 表示 FIFO 已满，`false` 表示未满。
     *
     *  @retval     true if controller TX FIFO is full
     *  @retval     false if controller TX FIFO is not full
     */
    __STATIC_INLINE bool DL_I2C_isControllerTXFIFOFull(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_TXFIFOCNT_MASK) ==
                I2C_MFIFOSR_TXFIFOCNT_MINIMUM);
    }

    /**
     *  @brief      Checks if controller TX FIFO is empty
     *              检查控制器 TX FIFO 是否为空。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If controller TX FIFO is empty
     *              返回值：`true` 表示 FIFO 为空，`false` 表示非空。
     *
     *  @retval     true if controller TX FIFO is empty
     *  @retval     false if controller TX FIFO is not empty
     */
    __STATIC_INLINE bool DL_I2C_isControllerTXFIFOEmpty(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_TXFIFOCNT_MASK) ==
                DL_I2C_TX_FIFO_COUNT_MAXIMUM);
    }

    /**
     *  @brief      Checks if controller RX FIFO is empty
     *              检查控制器 RX FIFO 是否为空。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If controller RX FIFO is empty
     *              返回值：`true` 表示 FIFO 为空，`false` 表示非空。
     *
     *  @retval     true if controller RX FIFO is empty
     *  @retval     false if controller RX FIFO is not empty
     */
    __STATIC_INLINE bool DL_I2C_isControllerRXFIFOEmpty(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_RXFIFOCNT_MASK) ==
                I2C_MFIFOSR_RXFIFOCNT_MINIMUM);
    }

    /**
     *  @brief      Reset transfers from from I2C controller
     *              重置控制器传输寄存器，恢复 I2C 初始状态。
     *
     *  Resets transfer register to initialize I2C
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_resetControllerTransfer(I2C_Regs *i2c)
    {
        // Resets all Controller functionality
        i2c->MASTER.MCTR = 0x00;
    }

    /**
     *  @brief      Sets up a transfer from I2C controller
     *              启动控制器传输，自动设置目标地址、方向、突发长度及 START/STOP。
     *
     *  Set target address, transfer direction, burst length, START+STOP generation.
     *  @note   Reading/writing data must be done separately.
     *          数据读写需另行操作。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *  @param[in]  targetAddr  Target address [0x00, 0x3FF]
     *                          目标地址 [0x00, 0x3FF]。
     *  @param[in]  direction   One of @ref DL_I2C_CONTROLLER_DIRECTION
     *                          传输方向。
     *  @param[in]  length      Intended burst length in number of bytes
     *                          [0x00, 0xFFF]
     *                          突发传输字节数。
     */
    __STATIC_INLINE void DL_I2C_startControllerTransfer(I2C_Regs *i2c,
                                                        uint32_t targetAddr, DL_I2C_CONTROLLER_DIRECTION direction,
                                                        uint16_t length)
    {
        // Specify target address and read/write mode
        DL_Common_updateReg(&i2c->MASTER.MSA,
                            ((targetAddr << I2C_MSA_SADDR_OFS) | (uint32_t)direction),
                            (I2C_MSA_SADDR_MASK | I2C_MSA_DIR_MASK));

        // STOP bit is generated after burst length number of bytes transferred
        DL_Common_updateReg(&i2c->MASTER.MCTR,
                            (((uint32_t)length << I2C_MCTR_MBLEN_OFS) | I2C_MCTR_BURSTRUN_ENABLE |
                             I2C_MCTR_START_ENABLE | I2C_MCTR_STOP_ENABLE),
                            (I2C_MCTR_MBLEN_MASK | I2C_MCTR_BURSTRUN_MASK | I2C_MCTR_START_MASK |
                             I2C_MCTR_STOP_MASK));
    }

    /**
     *  @brief      Sets up a transfer from I2C controller with control of START,
     *  STOP and ACK
     *              启动控制器传输，可分别控制 START、STOP 和 ACK 行为。
     *
     *  @note   Reading/writing data must be done separately.
     *          数据读写需另行操作。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  targetAddr  7-bit target address [0x00, 0x7f]
     *                          7 位目标地址。
     *  @param[in]  direction   One of @ref DL_I2C_CONTROLLER_DIRECTION
     *                          传输方向。
     *  @param[in]  length      Intended burst length in number of bytes
     *                          突发传输字节数。
     *  @param[in]  start       One of @ref DL_I2C_CONTROLLER_START
     *                          START 条件使能。
     *  @param[in]  stop        One of @ref DL_I2C_CONTROLLER_STOP
     *                          STOP 条件使能。
     *  @param[in]  ack         One of @ref DL_I2C_CONTROLLER_ACK
     *                          ACK 控制。
     */
    __STATIC_INLINE void DL_I2C_startControllerTransferAdvanced(I2C_Regs *i2c,
                                                                uint32_t targetAddr, DL_I2C_CONTROLLER_DIRECTION direction,
                                                                uint16_t length, DL_I2C_CONTROLLER_START start,
                                                                DL_I2C_CONTROLLER_STOP stop, DL_I2C_CONTROLLER_ACK ack)
    {
        // Specify target address and read/write mode
        DL_Common_updateReg(&i2c->MASTER.MSA,
                            ((targetAddr << I2C_MSA_SADDR_OFS) | (uint32_t)direction),
                            (I2C_MSA_SADDR_MASK | I2C_MSA_DIR_MASK));

        DL_Common_updateReg(&i2c->MASTER.MCTR,
                            (((uint32_t)length << I2C_MCTR_MBLEN_OFS) | I2C_MCTR_BURSTRUN_ENABLE |
                             (uint32_t)start | (uint32_t)stop | (uint32_t)ack),
                            (I2C_MCTR_MBLEN_MASK | I2C_MCTR_BURSTRUN_MASK | I2C_MCTR_START_MASK |
                             I2C_MCTR_STOP_MASK | I2C_MCTR_ACK_MASK));
    }

    /**
     *  @brief      Checks if target TX FIFO is full
     *              检查目标 TX FIFO 是否已满。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target TX FIFO is full
     *              返回值：`true` 表示 FIFO 已满，`false` 表示未满。
     *
     *  @retval     true if target TX FIFO is full
     *  @retval     false if target TX FIFO is not full
     */
    __STATIC_INLINE bool DL_I2C_isTargetTXFIFOFull(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_TXFIFOCNT_MASK) ==
                I2C_SFIFOSR_TXFIFOCNT_MINIMUM);
    }

    /**
     *  @brief      Checks if target TX FIFO is empty
     *              检查目标 TX FIFO 是否为空。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target TX FIFO is empty
     *              返回值：`true` 表示 FIFO 为空，`false` 表示非空。
     *
     *  @retval     true if target TX FIFO is empty
     *  @retval     false if target TX FIFO is not empty
     */
    __STATIC_INLINE bool DL_I2C_isTargetTXFIFOEmpty(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_TXFIFOCNT_MASK) ==
                DL_I2C_TX_FIFO_COUNT_MAXIMUM);
    }

    /**
     *  @brief      Checks if target RX FIFO is empty
     *              检查目标 RX FIFO 是否为空。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target RX FIFO is empty
     *              返回值：`true` 表示 FIFO 为空，`false` 表示非空。
     *
     *  @retval     true if target RX FIFO is empty
     *  @retval     false if target RX FIFO is not empty
     */
    __STATIC_INLINE bool DL_I2C_isTargetRXFIFOEmpty(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_RXFIFOCNT_MASK) ==
                I2C_SFIFOSR_RXFIFOCNT_MINIMUM);
    }

    /**
     *  @brief      Fills the target TX FIFO with data
     *  @details    功能：将缓存区数据写入目标模式 TX FIFO，写满即停止。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      参数：I2C 外设寄存器基址。
     *  @param[in]  buffer  Pointer to buffer of bytes
     *                      参数：待发送数据缓冲区首地址。
     *  @param[in]  count   Number of bytes to fill target TX FIFO from buffer
     *                      参数：期望写入的字节数量。
     *
     *  @return     Number of bytes that were successfully written
     *              返回值：实际成功写入 FIFO 的字节数。
     */
    uint8_t DL_I2C_fillTargetTXFIFO(
        I2C_Regs *i2c, const uint8_t *buffer, uint8_t count);

    /**
     *  @brief      Flushes/removes all elements in the target TX FIFO
     *  @details    功能：清空目标模式 TX FIFO 并等待硬件完成。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      参数：I2C 外设寄存器基址。
     *
     *  @return     返回值：无。
     */
    void DL_I2C_flushTargetTXFIFO(I2C_Regs *i2c);

    /**
     *  @brief      Flushes/removes all elements in the target RX FIFO
     *  @details    功能：清空目标模式 RX FIFO 并等待硬件完成。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      参数：I2C 外设寄存器基址。
     *
     *  @return     返回值：无。
     */
    void DL_I2C_flushTargetRXFIFO(I2C_Regs *i2c);

    /**
     *  @brief  Transmit target data, blocking until transmit request is received.
     * 			Will wait indefintely until bus is not busy. Note that if data is
     *          already present in the TX FIFO when this API is called, it will
     *          block until all data is sent.
     *  @details 功能：阻塞等待发送请求后发送 1 字节，并等待总线空闲。
     *
     *  @note   Setting own target addresses and enabling target should be done
     *  separately.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      参数：I2C 外设寄存器基址。
     *  @param[in]  data    Byte of data to transmit
     *                      参数：待发送字节。
     *
     *  @return     返回值：无。
     */
    void DL_I2C_transmitTargetDataBlocking(I2C_Regs *i2c, uint8_t data);

    /**
     *  @brief  Transmit target data
     *  @details 功能：尝试发送 1 字节，若 TX FIFO 满则直接返回失败。
     *
     *  @note   Setting own target addresses and enabling target should be done
     *  separately.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      参数：I2C 外设寄存器基址。
     *  @param[in]  data    Byte of data to transmit
     *                      参数：待发送字节。
     *
     *  @return Whether data could be transmitted or not
     *  @retval true if data could be transmitted
     *  @retval false if data could not be transmitted
     *          返回值：`true` 表示发送成功，`false` 表示 FIFO 满。
     */
    bool DL_I2C_transmitTargetDataCheck(I2C_Regs *i2c, uint8_t data);

    /**
     *  @brief  Receive target data, waiting until receive request
     *  @details 功能：阻塞等待接收请求后读取 1 字节目标数据。
     *
     *  @note   Setting own target addresses and enabling target should be done
     *  separately.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      参数：I2C 外设寄存器基址。
     *
     *  @return Data received from target
     *          返回值：读取到的目标数据字节。
     */
    uint8_t DL_I2C_receiveTargetDataBlocking(const I2C_Regs *i2c);

