zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
    /**
     *  @brief  Receive target data
     *  @details 功能：尝试读取 1 字节，若 RX FIFO 为空则返回失败。
     *
     *  @note   Setting own target addresses and enabling target should be done
     *  separately.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      参数：I2C 外设寄存器基址。
     *  @param[in]  buffer  Pointer to where byte of received data should be stored
     *                      参数：接收数据输出缓冲区指针。
     *
     *  @return Whether data could be received or not
     *  @retval true if data could be received
     *  @retval false if data could not be received
     *          返回值：`true` 表示读取成功，`false` 表示 FIFO 为空。
     */
    bool DL_I2C_receiveTargetDataCheck(const I2C_Regs *i2c, uint8_t *buffer);

    /**
     * @brief Enables the Peripheral Write Enable (PWREN) register for the I2C
     *        使能 I2C 外设电源写入使能寄存器。
     *
     *  Before any peripheral registers can be configured by software, the
     *  peripheral itself must be enabled by writing the ENABLE bit together with
     *  the appropriate KEY value to the peripheral's PWREN register.
     *
     * @param i2c        Pointer to the register overlay for the peripheral
     *                   I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enablePower(I2C_Regs *i2c)
    {
        i2c->GPRCM.PWREN = (I2C_PWREN_KEY_UNLOCK_W | I2C_PWREN_ENABLE_ENABLE);
    }

    /**
     * @brief Disables the Peripheral Write Enable (PWREN) register for the I2C
     *        禁用 I2C 外设电源写入使能寄存器。
     *
     *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
     *  accessible for read/write operations.
     *
     *  @note This API does not provide large power savings.
     *        该 API 节能效果有限。
     *
     * @param i2c        Pointer to the register overlay for the peripheral
     *                   I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disablePower(I2C_Regs *i2c)
    {
        i2c->GPRCM.PWREN = (I2C_PWREN_KEY_UNLOCK_W | I2C_PWREN_ENABLE_DISABLE);
    }

    /**
     * @brief Returns if the Peripheral Write Enable (PWREN) register for the I2C
     *        is enabled
     *        检查 I2C 外设电源写入使能是否已启用。
     *
     *  Before any peripheral registers can be configured by software, the
     *  peripheral itself must be enabled by writing the ENABLE bit together with
     *  the appropriate KEY value to the peripheral's PWREN register.
     *
     *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
     *  accessible for read/write operations.
     *
     * @param i2c        Pointer to the register overlay for the peripheral
     *                   I2C 外设寄存器基址。
     *
     * @return true if peripheral register access is enabled
     * @return false if peripheral register access is disabled
     *         返回值：`true` 表示已使能，`false` 表示已禁用。
     */
    __STATIC_INLINE bool DL_I2C_isPowerEnabled(const I2C_Regs *i2c)
    {
        return (
            (i2c->GPRCM.PWREN & I2C_PWREN_ENABLE_MASK) == I2C_PWREN_ENABLE_ENABLE);
    }

    /**
     * @brief Resets i2c peripheral
     *        复位 I2C 外设。
     *
     * @param i2c        Pointer to the register overlay for the peripheral
     *                   I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_reset(I2C_Regs *i2c)
    {
        i2c->GPRCM.RSTCTL =
            (I2C_RSTCTL_KEY_UNLOCK_W | I2C_RSTCTL_RESETSTKYCLR_CLR |
             I2C_RSTCTL_RESETASSERT_ASSERT);
    }

    /**
     * @brief Returns if i2c peripheral was reset
     *        检查 I2C 外设是否已复位。
     *
     * @param i2c        Pointer to the register overlay for the peripheral
     *                   I2C 外设寄存器基址。
     *
     * @return true if peripheral was reset
     * @return false if peripheral wasn't reset
     *         返回值：`true` 表示已复位，`false` 表示未复位。
     */
    __STATIC_INLINE bool DL_I2C_isReset(const I2C_Regs *i2c)
    {
        return ((i2c->GPRCM.STAT & I2C_STAT_RESETSTKY_MASK) ==
                I2C_STAT_RESETSTKY_RESET);
    }

    /**
     * @brief Set Clock Source
     *        设置 I2C 时钟源。
     *
     *  Clock sources depend on device and clock should be enabled
     *
     *  @param[in]  i2c            Pointer to the register overlay for the
     *                             peripheral
     *                             I2C 外设寄存器基址。
     *  @param[in]  clockSource    One of @ref DL_I2C_CLOCK.
     *                             时钟源选择。
     */
    __STATIC_INLINE void DL_I2C_selectClockSource(
        I2C_Regs *i2c, DL_I2C_CLOCK clockSource)
    {
        DL_Common_updateReg(&i2c->CLKSEL, (uint32_t)clockSource,
                            I2C_CLKSEL_BUSCLK_SEL_MASK | I2C_CLKSEL_MFCLK_SEL_MASK);
    }

    /**
     * @brief Set Clock Divider
     *        设置 I2C 时钟分频比。
     *
     *  @param[in]  i2c            Pointer to the register overlay for the
     *                             peripheral
     *                             I2C 外设寄存器基址。
     *  @param[in]  clockDivider   One of @ref DL_I2C_CLOCK_DIVIDE.
     *                             时钟分频比。
     */
    __STATIC_INLINE void DL_I2C_selectClockDivider(
        I2C_Regs *i2c, DL_I2C_CLOCK_DIVIDE clockDivider)
    {
        DL_Common_updateReg(
            &i2c->CLKDIV, (uint32_t)clockDivider, I2C_CLKDIV_RATIO_MASK);
    }

    /**
     *  @brief      Get Analog Glitch Suppression Pulse Width
     *              获取模拟毛刺抑制脉冲宽度。
     *
     *  Pulse width for the analog glitch suppression on SCL/SDA lines.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Analog glitch suppression pulse width
     *              返回值：当前模拟毛刺滤波宽度。
     *
     *  @retval     One of @ref DL_I2C_ANALOG_GLITCH_FILTER_WIDTH.
     */
    __STATIC_INLINE DL_I2C_ANALOG_GLITCH_FILTER_WIDTH
    DL_I2C_getAnalogGlitchFilterPulseWidth(const I2C_Regs *i2c)
    {
        uint32_t filterWidth = i2c->GFCTL & I2C_GFCTL_AGFSEL_MASK;

        return (DL_I2C_ANALOG_GLITCH_FILTER_WIDTH)(filterWidth);
    }

    /**
     *  @brief      Set Analog Glitch Suppression Pulse Width
     *              设置模拟毛刺抑制脉冲宽度。
     *
     *  Pulse width for the analog glitch suppression on SCL/SDA lines.
     *
     *  @param[in]  i2c            Pointer to the register overlay for the
     *                             peripheral
     *                             I2C 外设寄存器基址。
     *  @param[in]  filterWidth    One of @ref DL_I2C_ANALOG_GLITCH_FILTER_WIDTH.
     *                             模拟毛刺滤波宽度。
     */
    __STATIC_INLINE void DL_I2C_setAnalogGlitchFilterPulseWidth(
        I2C_Regs *i2c, DL_I2C_ANALOG_GLITCH_FILTER_WIDTH filterWidth)
    {
        DL_Common_updateReg(
            &i2c->GFCTL, (uint32_t)filterWidth, I2C_GFCTL_AGFSEL_MASK);
    }

    /**
     *  @brief      Get Digital Glitch Suppression Pulse Width
     *              获取数字毛刺抑制脉冲宽度（单位：功能时钟周期）。
     *
     *  Pulse width for the digital glitch suppression on SCL/SDA lines.
     *  Values are in terms of functional clock ticks.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Digital glitch suppression pulse width
     *              返回值：当前数字毛刺滤波宽度。
     *
     *  @retval     One of @ref DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH.
     */
    __STATIC_INLINE DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH
    DL_I2C_getDigitalGlitchFilterPulseWidth(const I2C_Regs *i2c)
    {
        uint32_t filterWidth = i2c->GFCTL & I2C_GFCTL_DGFSEL_MASK;

        return (DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH)(filterWidth);
    }

    /**
     *  @brief      Set Digital Glitch Suppression Pulse Width
     *              设置数字毛刺抑制脉冲宽度（单位：功能时钟周期）。
     *
     *  Pulse width for the digital glitch suppression on SCL/SDA lines.
     *  Values are in terms of functional clock ticks.
     *
     *  @param[in]  i2c             Pointer to the register overlay for the
     *                              peripheral
     *                              I2C 外设寄存器基址。
     *  @param[in]  filterWidth     One of @ref DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH.
     *                              数字毛刺滤波宽度。
     */
    __STATIC_INLINE void DL_I2C_setDigitalGlitchFilterPulseWidth(
        I2C_Regs *i2c, DL_I2C_DIGITAL_GLITCH_FILTER_WIDTH filterWidth)
    {
        DL_Common_updateReg(
            &i2c->GFCTL, (uint32_t)filterWidth, I2C_GFCTL_DGFSEL_MASK);
    }

    /**
     *  @brief      Disable Analog Glitch Suppression
     *              禁用模拟毛刺抑制。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableAnalogGlitchFilter(I2C_Regs *i2c)
    {
        i2c->GFCTL &= ~(I2C_GFCTL_AGFEN_MASK);
    }

    /**
     *  @brief      Checks if analog glitch suppression is enabled
     *              检查模拟毛刺抑制是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If analog glitch suppression is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if analog glitch suppression is enabled
     *  @retval     false if analog glitch suppression is disabled
     */
    __STATIC_INLINE bool DL_I2C_isAnalogGlitchFilterEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->GFCTL & I2C_GFCTL_AGFEN_MASK) == I2C_GFCTL_AGFEN_ENABLE);
    }

    /**
     *  @brief      Enable Analog Glitch Suppression
     *              启用模拟毛刺抑制。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableAnalogGlitchFilter(I2C_Regs *i2c)
    {
        i2c->GFCTL |= I2C_GFCTL_AGFEN_ENABLE;
    }

    /**
     *  @brief      Get direction of next controller operation
     *              获取控制器下一次操作的传输方向。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Direction of next controller operation
     *              返回值：传输方向。
     *
     *  @retval     One of @ref DL_I2C_CONTROLLER_DIRECTION
     */
    __STATIC_INLINE DL_I2C_CONTROLLER_DIRECTION DL_I2C_getControllerDirection(
        const I2C_Regs *i2c)
    {
        uint32_t direction = i2c->MASTER.MSA & I2C_MSA_DIR_MASK;

        return (DL_I2C_CONTROLLER_DIRECTION)(direction);
    }

    /**
     *  @brief      Set direction of next controller operation
     *              设置控制器下一次操作的传输方向。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @param[in]  direction   Direction of next controller operation.
     *                          One of @ref DL_I2C_CONTROLLER_DIRECTION.
     *                          传输方向。
     */
    __STATIC_INLINE void DL_I2C_setControllerDirection(
        I2C_Regs *i2c, DL_I2C_CONTROLLER_DIRECTION direction)
    {
        DL_Common_updateReg(
            &i2c->MASTER.MSA, (uint32_t)direction, I2C_MSA_DIR_MASK);
    }

    /**
     *  @brief      Get the address of the target being addressed when configured
     *              as an I2C controller
     *              获取控制器模式下当前寻址的目标地址。
     *
     *  Specifies bits A9 through A0 of the target address.
     *  In 7-bit addressing mode as selected by @ref DL_I2C_setTargetAddressingMode,
     *  the top 3 bits are don't care.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     The target address
     *              返回值：目标地址 [0x00, 0x07FE]。
     *
     *  @retval     [0x00, 0x07FE]
     *
     *  @sa         DL_I2C_setTargetAddressingMode
     */
    __STATIC_INLINE uint32_t DL_I2C_getTargetAddress(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MSA & I2C_MSA_SADDR_MASK) >> I2C_MSA_SADDR_OFS);
    }

    /**
     *  @brief      Set the address of the target being addressed when configured
     *              as an I2C controller
     *              设置控制器模式下要寻址的目标地址。
     *
     *  Specifies bits A9 through A0 of the target address.
     *  In 7-bit addressing mode as selected by @ref DL_I2C_setTargetAddressingMode,
     *  the top 3 bits are don't care.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  targetAddress    Target address to set [0x00, 0x07FE]
     *                              目标地址 [0x00, 0x07FE]。
     *
     *  @sa         DL_I2C_setTargetAddressingMode
     */
    __STATIC_INLINE void DL_I2C_setTargetAddress(
        I2C_Regs *i2c, uint32_t targetAddress)
    {
        DL_Common_updateReg(&i2c->MASTER.MSA, (targetAddress << I2C_MSA_SADDR_OFS),
                            I2C_MSA_SADDR_MASK);
    }

    /**
     *  @brief      Get controller addressing mode
     *              获取控制器寻址模式（7 位或 10 位）。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Addressing mode the controller is set to
     *              返回值：当前寻址模式。
     *
     *  @retval     One of @ref DL_I2C_CONTROLLER_ADDRESSING_MODE
     */
    __STATIC_INLINE DL_I2C_CONTROLLER_ADDRESSING_MODE
    DL_I2C_getControllerAddressingMode(const I2C_Regs *i2c)
    {
        uint32_t mode = i2c->MASTER.MSA & I2C_MSA_MMODE_MASK;

