zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
        return (DL_I2C_CONTROLLER_ADDRESSING_MODE)(mode);
    }

    /**
     *  @brief      Set controller addressing mode between 7-bit and 10-bit mode
     *              设置控制器寻址模式（7 位或 10 位）。
     *
     *  Selects the addressing mode between 7-bit and 10-bit mode to be used when
     *  device is configured as a controller
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  mode    Addressing mode to set the target to.
     *                      One of @ref DL_I2C_CONTROLLER_ADDRESSING_MODE.
     *                      寻址模式。
     */
    __STATIC_INLINE void DL_I2C_setControllerAddressingMode(
        I2C_Regs *i2c, DL_I2C_CONTROLLER_ADDRESSING_MODE mode)
    {
        DL_Common_updateReg(&i2c->MASTER.MSA, (uint32_t)mode, I2C_MSA_MMODE_MASK);
    }

    /**
     *  @brief      Disable controller ACK override
     *              禁用控制器 ACK 覆盖。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableControllerACKOverride(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR &= ~(I2C_MCTR_MACKOEN_MASK);
    }

    /**
     *  @brief      Checks if controller ACK override is enabled
     *              检查控制器 ACK 覆盖是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If controller ACK override is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if controller ACK override is enabled
     *  @retval     false if controller ACK override is disabled
     */
    __STATIC_INLINE bool DL_I2C_isControllerACKOverrideEnabled(const I2C_Regs *i2c)
    {
        return (
            (i2c->MASTER.MCTR & I2C_MCTR_MACKOEN_MASK) == I2C_MCTR_MACKOEN_ENABLE);
    }

    /**
     *  @brief      Enable controller ACK override
     *              启用控制器 ACK 覆盖，允许软件手动控制 ACK/NACK。
     *
     *  When enabled and the controller is receiving data and the number of bytes
     *  indicated in MCTR.MBLEN have been received, the state machine will generate
     *  an RXDONE interrupt and wait at the start of the ACK for FW to indicate if
     *  an ACK or NACK should be sent. The ACK or NACK is selected by writing the
     *  MCTR register and setting ACK accordingly. The other fields in this register
     *  can also be written at this time to continue on with the transaction. If a
     *  NACK is sent the state machine will automatically send a Stop.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     * @sa          DL_I2C_setTransactionLength
     */
    __STATIC_INLINE void DL_I2C_enableControllerACKOverride(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR |= I2C_MCTR_MACKOEN_ENABLE;
    }

    /**
     *  @brief      Disable controller read on TX empty
     *              禁用控制器 TX 空后自动读取功能。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableControllerReadOnTXEmpty(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR &= ~(I2C_MCTR_RD_ON_TXEMPTY_MASK);
    }

    /**
     *  @brief      Checks if controller read on TX empty is enabled
     *              检查控制器 TX 空后自动读取是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If controller read on TX empty is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if controller read on TX empty is enabled
     *  @retval     false if controller read on TX empty is disabled
     */
    __STATIC_INLINE bool DL_I2C_isControllerReadOnTXEmptyEnabled(
        const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MCTR & I2C_MCTR_RD_ON_TXEMPTY_MASK) ==
                I2C_MCTR_RD_ON_TXEMPTY_ENABLE);
    }

    /**
     *  @brief      Enable controller read on TX empty
     *              启用控制器 TX 空后自动切换为读模式。
     *
     *  When enabled, the controller will transmit all bytes from the TX FIFO
     *  before continuing with the programmed Burst Run Read. If the DIR is not
     *  set to Read in the MSA then this bit is ignored. The Start must be set in
     *  the MCTR for proper I2C protocol. The controller will first send the Start
     *  Condition, I2C Address with R/W bit set to write, before sending the bytes
     *  in the TX FIFO. When the TX FIFO is empty, the I2C transaction will
     *  continue as programmed in MTCR and MSA without sending a Stop Condition.
     *  This is intended to be used to perform simple I2C command based reads
     *  transition that will complete after initiating them without having to get
     *  an interrupt to turn the bus around.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableControllerReadOnTXEmpty(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR |= I2C_MCTR_RD_ON_TXEMPTY_ENABLE;
    }

    /**
     *  @brief      Get the SMBus/PMBus Packet Error Checking (PEC) count value
     *              获取控制器 PEC 计数值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     The value the PEC count is set to
     *              返回值：PEC 计数值 [0x0, 0x01FF]。
     *
     *  @retval     Value between [0x0, 0x01FF]
     */
    __STATIC_INLINE uint32_t DL_I2C_getControllerPECCountValue(const I2C_Regs *i2c)
    {
        return (i2c->MASTER.CONTROLLER_I2CPECCTL &
                I2C_CONTROLLER_I2CPECCTL_PECCNT_MASK);
    }

    /**
     *  @brief      Set the SMBus/PMBus Packet Error Checking (PEC) count value
     *              设置控制器 PEC 计数值。
     *
     *  When this field is non zero, the number of I2C data bytes are counted.
     *  Refer to the device TRM for more details.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  count   The value to set the PEC count to.
     *                      Value between [0x0, 0x01FF]
     *                      PEC 计数值。
     */
    __STATIC_INLINE void DL_I2C_setControllerPECCountValue(
        I2C_Regs *i2c, uint32_t count)
    {
        DL_Common_updateReg(&i2c->MASTER.CONTROLLER_I2CPECCTL, count,
                            I2C_CONTROLLER_I2CPECCTL_PECCNT_MASK);
    }

    /**
     *  @brief      Disable controller SMBus/PMBus Packet Error Checking (PEC)
     *              禁用控制器 PEC 校验。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableControllerPEC(I2C_Regs *i2c)
    {
        i2c->MASTER.CONTROLLER_I2CPECCTL &= ~(I2C_CONTROLLER_I2CPECCTL_PECEN_MASK);
    }

    /**
     *  @brief      Checks if controller SMBus/PMBus Packet Error Checking (PEC)
     *              is enabled
     *              检查控制器 PEC 校验是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If controller PEC is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if controller PEC is enabled
     *  @retval     false if controller PEC is disabled
     */
    __STATIC_INLINE bool DL_I2C_isControllerPECEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.CONTROLLER_I2CPECCTL &
                 I2C_CONTROLLER_I2CPECCTL_PECEN_MASK) ==
                I2C_CONTROLLER_I2CPECCTL_PECEN_ENABLE);
    }

    /**
     *  @brief      Enable controller SMBus/PMBus Packet Error Checking (PEC)
     *              启用控制器 PEC 校验，多项式为 x^8 + x^2 + x^1 + 1。
     *
     *  When enabled, the PEC is calculated on all bits accept the Start, Stop, ACK
     *  and NACK. The PEC LSFR and the Byte Counter is set to 0 when the State
     *  Machine is in the IDLE state, which occurs following a Stop or when a
     *  timeout occurs. The Counter is also set to 0 after the PEC byte is sent or
     *  received. Note that the NACK is automatically sent following a PEC byte
     *  that results in a PEC error.
     *  The PEC Polynomial is x^8 + x^2 + x^1 + 1.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableControllerPEC(I2C_Regs *i2c)
    {
        i2c->MASTER.CONTROLLER_I2CPECCTL |= I2C_CONTROLLER_I2CPECCTL_PECEN_ENABLE;
    }

    /**
     *  @brief      Get the current SMBus/PMBus PEC byte count of the controller
     *              state machine
     *              获取控制器状态机当前 PEC 字节计数。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     The current PEC byte count of the controller state machine
     *              返回值：当前 PEC 字节计数 [0x0, 0x01FF]。
     *
     *  @retval     Value between [0x0, 0x01FF]
     */
    __STATIC_INLINE uint32_t DL_I2C_getControllerCurrentPECCount(
        const I2C_Regs *i2c)
    {
        return (
            i2c->MASTER.CONTROLLER_PECSR & I2C_CONTROLLER_PECSR_PECSTS_CHECK_MASK);
    }

    /**
     *  @brief      If controller SMBus/PMBus PEC was checked in last transaction
     *              查询上次事务是否执行了控制器 PEC 校验。
     *
     *  The status of if the controller PEC was checked in the transaction that
     *  occurred before the last Stop. Latched on Stop.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Status of controller PEC checked in last transaction
     *              返回值：上次事务 PEC 校验状态。
     *
     *  @retval     One of @ref DL_I2C_CONTROLLER_PEC_STATUS
     */
    __STATIC_INLINE DL_I2C_CONTROLLER_PEC_STATUS
    DL_I2C_getControllerPECCheckedStatus(const I2C_Regs *i2c)
    {
        uint32_t status =
            i2c->MASTER.CONTROLLER_PECSR & I2C_CONTROLLER_PECSR_PECSTS_CHECK_MASK;

