zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
        return (DL_I2C_CONTROLLER_PEC_STATUS)(status);
    }

    /**
     *  @brief      Get the status of the controller SMBus/PMBus PEC Check error
     *              查询上次事务的控制器 PEC 校验错误状态。
     *
     *  The status of if a PEC check error occurred in the transaction that
     *  occurred before the last Stop. Latched on Stop.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Status of controller PEC check error
     *              返回值：PEC 校验错误状态。
     *
     *  @retval     One of @ref DL_I2C_CONTROLLER_PEC_CHECK_ERROR
     */
    __STATIC_INLINE DL_I2C_CONTROLLER_PEC_CHECK_ERROR
    DL_I2C_getControllerPECCheckError(const I2C_Regs *i2c)
    {
        uint32_t error =
            i2c->MASTER.CONTROLLER_PECSR & I2C_CONTROLLER_PECSR_PECSTS_ERROR_MASK;

        return (DL_I2C_CONTROLLER_PEC_CHECK_ERROR)(error);
    }

    /**
     *  @brief      Disable I2C controller burst mode
     *              禁用控制器突发传输模式。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableControllerBurst(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR &= ~(I2C_MCTR_BURSTRUN_MASK);
    }

    /**
     *  @brief      Checks if I2C controller burst mode is enabled
     *              检查控制器突发传输模式是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If I2C controller burst mode is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if I2C controller burst mode is enabled
     *  @retval     false if I2C controller burst mode is disabled
     */
    __STATIC_INLINE bool DL_I2C_isControllerBurstEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->GFCTL & I2C_MCTR_BURSTRUN_MASK) == I2C_MCTR_BURSTRUN_ENABLE);
    }

    /**
     *  @brief      Enable I2C controller burst mode
     *              启用控制器突发传输模式。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableControllerBurst(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR |= I2C_MCTR_BURSTRUN_ENABLE;
    }

    /**
     *  @brief      Disable I2C START generation
     *              禁用 I2C START 条件生成。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableStartCondition(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR &= ~(I2C_MCTR_START_MASK);
    }

    /**
     *  @brief      Checks if I2C START generation is enabled
     *              检查 I2C START 条件生成是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If I2C START generation is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if I2C START generation is enabled
     *  @retval     false if I2C START generation is disabled
     */
    __STATIC_INLINE bool DL_I2C_isStartConditionEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MCTR & I2C_MCTR_START_MASK) == I2C_MCTR_START_ENABLE);
    }

    /**
     *  @brief      Enable I2C START generation
     *              启用 I2C START 条件生成。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableStartCondition(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR |= I2C_MCTR_START_ENABLE;
    }

    /**
     *  @brief      Disable I2C STOP generation
     *              禁用 I2C STOP 条件生成。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableStopCondition(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR &= ~(I2C_MCTR_STOP_MASK);
    }

    /**
     *  @brief      Checks if I2C STOP generation is enabled
     *              检查 I2C STOP 条件生成是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If I2C STOP generation is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if I2C STOP generation is enabled
     *  @retval     false if I2C STOP generation is disabled
     */
    __STATIC_INLINE bool DL_I2C_isStopConditionEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MCTR & I2C_MCTR_STOP_MASK) == I2C_MCTR_STOP_ENABLE);
    }

    /**
     *  @brief      Enable I2C STOP generation
     *              启用 I2C STOP 条件生成。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableStopCondition(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR |= I2C_MCTR_STOP_ENABLE;
    }

    /**
     *  @brief      Disable I2C controller data acknowledge (ACK or NACK)
     *              禁用控制器数据应答（ACK），收到数据后不自动应答。
     *
     *  When the I2C module operates in Controller receiver mode, the ACK bit can be
     *  cleared when no further data needs to be received from the target
     *  transmitter.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableControllerACK(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR &= ~(I2C_MCTR_ACK_MASK);
    }

    /**
     *  @brief      Checks if I2C controller data acknowledge (ACK or NACK) is
     *              enabled
     *              检查控制器数据应答是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If I2C controller data acknowledge is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if I2C controller data acknowledge is enabled
     *  @retval     false if I2C controller data acknowledge is disabled
     */
    __STATIC_INLINE bool DL_I2C_isControllerACKEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MCTR & I2C_MCTR_ACK_MASK) == I2C_MCTR_ACK_ENABLE);
    }

    /**
     *  @brief      Enable I2C controller data acknowledge (ACK or NACK)
     *              启用控制器数据应答（ACK），收到数据后自动应答。
     *
     *  When the I2C module operates in Controller receiver mode, the ACK bit is
     *  normally set causing the I2C bus controller to transmit an acknowledge
     *  automatically after each byte.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableControllerACK(I2C_Regs *i2c)
    {
        i2c->MASTER.MCTR |= I2C_MCTR_ACK_MASK;
    }

    /**
     *  @brief      Get transaction length in bytes
     *              获取当前事务长度（字节数）。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Length of I2C transaction in bytes
     *              返回值：事务长度 [0x000, 0xfff]。
     *
     *  @retval     [0x000, 0xfff]
     */
    __STATIC_INLINE uint32_t DL_I2C_getTransactionLength(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MCTR & I2C_MCTR_MBLEN_MASK) >> I2C_MCTR_MBLEN_OFS);
    }

    /**
     *  @brief      Set transaction length in bytes
     *              设置事务长度（字节数）。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @param[in]  length      Length of I2C transaction in bytes [0x000, 0xfff]
     *                          事务长度。
     */
    __STATIC_INLINE void DL_I2C_setTransactionLength(
        I2C_Regs *i2c, uint32_t length)
    {
        DL_Common_updateReg(&i2c->MASTER.MCTR, (length << I2C_MCTR_MBLEN_OFS),
                            I2C_MCTR_MBLEN_MASK);
    }

    /**
     *  @brief      Get status of I2C bus controller for controller
     *              获取控制器状态寄存器值。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @return     Status of I2C bus controller for controller
     *              返回值：控制器状态，@ref DL_I2C_CONTROLLER_STATUS 的按位或。
     *
     *  @retval     Bitwise OR of @ref DL_I2C_CONTROLLER_STATUS
     */
    __STATIC_INLINE uint32_t DL_I2C_getControllerStatus(const I2C_Regs *i2c)
    {
        return (i2c->MASTER.MSR);
    }

    /**
     *  @brief      Get transaction count in bytes
     *              获取事务剩余字节倒计数值。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @return     Current 12-bit countdown value of the transaction
     *              返回值：12 位倒计数值 [0x000, 0xfff]。
     *
     *  @retval     [0x000, 0xfff]
     */
    __STATIC_INLINE uint16_t DL_I2C_getTransactionCount(const I2C_Regs *i2c)
    {
        return ((uint16_t)((i2c->MASTER.MSR & I2C_MSR_MBCNT_MASK) >> I2C_MSR_MBCNT_OFS));
    }

    /**
     *  @brief      Get byte of data from I2C controller
     *              从控制器 RX FIFO 读取 1 字节数据。
     *
     *  If using FIFO, it is first byte from the RX FIFO.
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @return     Last received byte of data
     *              返回值：接收到的数据字节 [0x00, 0xff]。
     *
     *  @retval     [0x00, 0xff]
     */
    __STATIC_INLINE uint8_t DL_I2C_receiveControllerData(const I2C_Regs *i2c)
    {
        return ((uint8_t)(i2c->MASTER.MRXDATA & I2C_MRXDATA_VALUE_MASK));
    }

    /**
     *  @brief      Set next byte to be transferred during the next transaction
     *              写入控制器 TX 数据寄存器，待启动传输后发送。
     *
     *  Does not transmit data until @ref DL_I2C_startControllerTransfer
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  data    Data to be transferred during the next transaction.
     *                      [0x00, 0xff]
     *                      待发送数据字节。
     */
    __STATIC_INLINE void DL_I2C_transmitControllerData(I2C_Regs *i2c, uint8_t data)
    {
        i2c->MASTER.MTXDATA = data;
    }

    /**
     *  @brief      Get timer period
     *              获取 SCL 定时器周期值，用于配置 I2C 时钟速率。
     *  This field is used in the equation to configure SCL_PERIOD:
     *
     *  SCL_PERIOD = (1 + TPR) * (SCL_LP + SCL_HP) * INT_CLK_PRD
     *
     *  where:
     *  SCL_PRD is the SCL line period (I2C clock)
     *
     *  TPR is the Timer Period register value (range of 1 to 127)
     *
     *  SCL_LP is the SCL Low period (fixed at 6)
     *  SCL_HP is the SCL High period (fixed at 4)
     *
     *  CLK_PRD is the functional clock period in ns
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @return     Timer period
     *              返回值：定时器周期 [0x00, 0x7f]。
     *
     *  @retval     [0x00, 0x7f]
     */
    __STATIC_INLINE uint8_t DL_I2C_getTimerPeriod(const I2C_Regs *i2c)
    {
        return ((uint8_t)(i2c->MASTER.MTPR & I2C_MTPR_TPR_MASK));
    }

    /**
     *  @brief      Set timer period
     *              设置 SCL 定时器周期值，用于配置 I2C 时钟速率。
     *  This field is used in the equation to configure SCL_PERIOD:
     *
     *  SCL_PERIOD = (1 + TPR) * (SCL_LP + SCL_HP) * INT_CLK_PRD
     *
     *  where:
     *  SCL_PRD is the SCL line period (I2C clock)
     *
     *  TPR is the Timer Period register value (range of 1 to 127)
     *
     *  SCL_LP is the SCL Low period (fixed at 6)
     *  SCL_HP is the SCL High period (fixed at 4)
     *
     *  CLK_PRD is the functional clock period in ns
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  period  Timer period [0x00, 0x7f]
     *                      定时器周期值。
     */
    __STATIC_INLINE void DL_I2C_setTimerPeriod(I2C_Regs *i2c, uint8_t period)
    {
        i2c->MASTER.MTPR = period;
    }

    /**
     *  @brief      Disable loopback mode
     *              禁用回环测试模式。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableLoopbackMode(I2C_Regs *i2c)
    {
        i2c->MASTER.MCR &= ~(I2C_MCR_LPBK_MASK);
    }

    /**
     *  @brief      Checks if loopback mode is enabled
     *              检查回环测试模式是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If loopback mode is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if loopback mode is enabled
     *  @retval     false if loopback mode is disabled
     */
    __STATIC_INLINE bool DL_I2C_isLoopbackModeEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MCR & I2C_MCR_LPBK_MASK) == I2C_MCR_LPBK_ENABLE);
    }

    /**
     *  @brief      Enable loopback mode
     *              启用回环测试模式。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableLoopbackMode(I2C_Regs *i2c)
    {
        i2c->MASTER.MCR |= I2C_MCR_LPBK_ENABLE;
    }

    /**
     *  @brief      Disable multicontroller mode
     *              禁用多控制器模式。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableMultiControllerMode(I2C_Regs *i2c)
    {
        i2c->MASTER.MCR &= ~(I2C_MCR_MMST_MASK);
    }

    /**
     *  @brief      Checks if multicontroller mode is enabled
     *              检查多控制器模式是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If multicontroller mode is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if multicontroller mode is enabled
     *  @retval     false if multicontroller mode is disabled
     */
    __STATIC_INLINE bool DL_I2C_isMultiControllerModeEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MCR & I2C_MCR_MMST_MASK) == I2C_MCR_MMST_ENABLE);
    }

    /**
     *  @brief      Enable multicontroller mode
     *              启用多控制器模式，SCL 高电平计时从检测到 SCL 高电平开始。
     *
     *  In multicontroller mode, the SCL high time counts once the SCL line has been
     *  detected high. If this is not enabled, the high time counts as soon as the
     *  SCL line has been set high by the I2C controller
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableMultiControllerMode(I2C_Regs *i2c)
    {
        i2c->MASTER.MCR |= I2C_MCR_MMST_ENABLE;
    }

    /**
     *  @brief      Disable controller
     *              禁用控制器。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableController(I2C_Regs *i2c)
    {
        i2c->MASTER.MCR &= ~(I2C_MCR_ACTIVE_MASK);
    }

    /**
     *  @brief      Checks if controller is enabled
     *              检查控制器是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If controller is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if controller is enabled
     *  @retval     false if controller is disabled
     */
    __STATIC_INLINE bool DL_I2C_isControllerEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MCR & I2C_MCR_ACTIVE_MASK) == I2C_MCR_ACTIVE_ENABLE);
    }

    /**
     *  @brief      Enable controller
     *              启用控制器。启用后需先禁用或复位才能重新启用，否则可能导致传输失败。
     *
     *  After controller has enabled, it should not be re-enabled unless it has been
     *  disabled or by a reset, otherwise transfer failures may occur.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableController(I2C_Regs *i2c)
    {
        i2c->MASTER.MCR |= I2C_MCR_ACTIVE_ENABLE;
    }

    /**
     *  @brief      Disable controller clock stretching
     *              禁用控制器时钟延展。
     *
     *  Clock stretching can be disabled if no target on the bus supports clock
     *  stretching; however, it should be typically enabled to be compliant with
     *  I2C specification.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableControllerClockStretching(I2C_Regs *i2c)
    {
        i2c->MASTER.MCR &= ~(I2C_MCR_CLKSTRETCH_MASK);
    }

    /**
     *  @brief      Checks if controller clock stretching is enabled
     *              检查控制器时钟延展是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If controller clock stretching is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if controller clock stretching is enabled
     *  @retval     false if controller clock stretching is disabled
     */
    __STATIC_INLINE bool DL_I2C_isControllerClockStretchingEnabled(
        const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MCR & I2C_MCR_CLKSTRETCH_MASK) ==
                I2C_MCR_CLKSTRETCH_ENABLE);
    }

    /**
     *  @brief      Enable controller clock stretching
     *              启用控制器时钟延展。
     *
     *  Clock stretching can be disabled if no target on the bus supports clock
     *  stretching; however, it should be typically enabled to be compliant with I2C
     *  specification.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableControllerClockStretching(I2C_Regs *i2c)
    {
        i2c->MASTER.MCR |= I2C_MCR_CLKSTRETCH_ENABLE;
    }

    /**
     *  @brief      Get SCL signal status
     *              获取 SCL 信号电平状态。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @return     Status of SCL signal
     *              返回值：SCL 信号状态。
     *
     *  @retval     One of @ref DL_I2C_CONTROLLER_SCL
     */
    __STATIC_INLINE DL_I2C_CONTROLLER_SCL DL_I2C_getSCLStatus(const I2C_Regs *i2c)
    {
        uint32_t sclStatus = i2c->MASTER.MBMON & I2C_MBMON_SCL_MASK;

