zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
        return (DL_I2C_CONTROLLER_SCL)(sclStatus);
    }

    /**
     *  @brief      Get SDA signal status
     *              获取 SDA 信号电平状态。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @return     Status of SDA signal
     *              返回值：SDA 信号状态。
     *
     *  @retval     One of @ref DL_I2C_CONTROLLER_SDA
     */
    __STATIC_INLINE DL_I2C_CONTROLLER_SDA DL_I2C_getSDAStatus(const I2C_Regs *i2c)
    {
        uint32_t sdaStatus = i2c->MASTER.MBMON & I2C_MBMON_SDA_MASK;

        return (DL_I2C_CONTROLLER_SDA)(sdaStatus);
    }

    /**
     *  @brief      Get controller TX FIFO threshold level
     *              获取控制器 TX FIFO 触发阈值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @return     Indicates at what fill level in the TX FIFO a threshold will be
     *              generated
     *              返回值：TX FIFO 触发阈值。
     *
     *  @retval     One of @ref DL_I2C_TX_FIFO_LEVEL
     */
    __STATIC_INLINE DL_I2C_TX_FIFO_LEVEL DL_I2C_getControllerTXFIFOThreshold(
        const I2C_Regs *i2c)
    {
        uint32_t level = i2c->MASTER.MFIFOCTL & I2C_MFIFOCTL_TXTRIG_MASK;

        return (DL_I2C_TX_FIFO_LEVEL)(level);
    }

    /**
     *  @brief      Set controller TX FIFO threshold level
     *              设置控制器 TX FIFO 触发阈值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  level   Indicates at what fill level in the TX FIFO a threshold
     *                      will be generated.
     *                      One of @ref DL_I2C_TX_FIFO_LEVEL.
     *                      TX FIFO 触发阈值。
     */
    __STATIC_INLINE void DL_I2C_setControllerTXFIFOThreshold(
        I2C_Regs *i2c, DL_I2C_TX_FIFO_LEVEL level)
    {
        DL_Common_updateReg(
            &i2c->MASTER.MFIFOCTL, (uint32_t)level, I2C_MFIFOCTL_TXTRIG_MASK);
    }

    /**
     *  @brief      Stop controller TX FIFO flush
     *              停止控制器 TX FIFO 刷新。
     *
     *  Before stopping the flush, check if @ref DL_I2C_isControllerTXFIFOEmpty,
     *  indicating flush is complete.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_stopFlushControllerTXFIFO(I2C_Regs *i2c)
    {
        i2c->MASTER.MFIFOCTL &= ~(I2C_MFIFOCTL_TXFLUSH_MASK);
    }

    /**
     *  @brief      Start controller TX FIFO flush
     *              启动控制器 TX FIFO 刷新。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_startFlushControllerTXFIFO(I2C_Regs *i2c)
    {
        i2c->MASTER.MFIFOCTL |= I2C_MFIFOCTL_TXFLUSH_MASK;
    }

    /**
     *  @brief      Get controller RX FIFO threshold level
     *              获取控制器 RX FIFO 触发阈值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @return     Indicates at what fill level in the RX FIFO a threshold will be
     *              generated
     *              返回值：RX FIFO 触发阈值。
     *
     *  @retval     One of @ref DL_I2C_RX_FIFO_LEVEL
     */
    __STATIC_INLINE DL_I2C_RX_FIFO_LEVEL DL_I2C_getControllerRXFIFOThreshold(
        const I2C_Regs *i2c)
    {
        uint32_t level = i2c->MASTER.MFIFOCTL & I2C_MFIFOCTL_RXTRIG_MASK;

        return (DL_I2C_RX_FIFO_LEVEL)(level);
    }

    /**
     *  @brief      Set controller RX FIFO threshold level
     *              设置控制器 RX FIFO 触发阈值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  level   Indicates at what fill level in the RX FIFO a threshold
     *                      will be generated.
     *                      One of @ref DL_I2C_RX_FIFO_LEVEL.
     *                      RX FIFO 触发阈值。
     */
    __STATIC_INLINE void DL_I2C_setControllerRXFIFOThreshold(
        I2C_Regs *i2c, DL_I2C_RX_FIFO_LEVEL level)
    {
        DL_Common_updateReg(
            &i2c->MASTER.MFIFOCTL, (uint32_t)level, I2C_MFIFOCTL_RXTRIG_MASK);
    }

    /**
     *  @brief      Stop controller RX FIFO flush
     *              停止控制器 RX FIFO 刷新。
     *
     *  Before stopping the flush, check if @ref DL_I2C_isControllerRXFIFOEmpty,
     *  indicating flush is complete.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_stopFlushControllerRXFIFO(I2C_Regs *i2c)
    {
        i2c->MASTER.MFIFOCTL &= ~(I2C_MFIFOCTL_RXFLUSH_MASK);
    }

    /**
     *  @brief      Start controller RX FIFO flush
     *              启动控制器 RX FIFO 刷新。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_startFlushControllerRXFIFO(I2C_Regs *i2c)
    {
        i2c->MASTER.MFIFOCTL |= I2C_MFIFOCTL_RXFLUSH_MASK;
    }

    /**
     *  @brief      Get number of bytes which can be read from RX FIFO
     *              获取控制器 RX FIFO 中可读取的字节数。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @return     Number of bytes which can be read from RX FIFO
     *              返回值：可读字节数 [0x0, 0x8]。
     *
     *  @retval     [0x0, 0x8]
     */
    __STATIC_INLINE uint32_t DL_I2C_getControllerRXFIFOCounter(const I2C_Regs *i2c)
    {
        return (i2c->MASTER.MFIFOSR & I2C_MFIFOSR_RXFIFOCNT_MASK);
    }

    /**
     *  @brief      Get number of bytes which can be put into TX FIFO
     *              获取控制器 TX FIFO 中可写入的字节数。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @return     Number of bytes which can be put into TX FIFO
     *              返回值：可写字节数 [0x0, 0x8]。
     *
     *  @retval     [0x0, 0x8]
     */
    __STATIC_INLINE uint32_t DL_I2C_getControllerTXFIFOCounter(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_TXFIFOCNT_MASK) >>
                I2C_MFIFOSR_TXFIFOCNT_OFS);
    }

    /**
     *  @brief      Checks if controller RX FIFO flush is active
     *              检查控制器 RX FIFO 刷新是否正在进行。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If controller RX FIFO flush is active
     *              返回值：`true` 表示刷新中，`false` 表示未刷新。
     *
     *  @retval     true if controller RX FIFO flush is active
     *  @retval     false if controller RX FIFO flush is not active
     */
    __STATIC_INLINE bool DL_I2C_isControllerRXFIFOFlushActive(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_RXFLUSH_MASK) ==
                I2C_MFIFOSR_RXFLUSH_ACTIVE);
    }

    /**
     *  @brief      Checks if controller TX FIFO flush is active
     *              检查控制器 TX FIFO 刷新是否正在进行。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If controller TX FIFO flush is active
     *              返回值：`true` 表示刷新中，`false` 表示未刷新。
     *
     *  @retval     true if controller TX FIFO flush is active
     *  @retval     false if controller TX FIFO flush is not active
     */
    __STATIC_INLINE bool DL_I2C_isControllerTXFIFOFlushActive(const I2C_Regs *i2c)
    {
        return ((i2c->MASTER.MFIFOSR & I2C_MFIFOSR_TXFLUSH_MASK) ==
                I2C_MFIFOSR_TXFLUSH_ACTIVE);
    }

    /**
     *  @brief      Set target own address
     *              设置目标自身地址。
     *
     * This field specifies bits A9 through A0 of the target own address.
     *
     * In 7-bit addressing mode as selected by @ref DL_I2C_setTargetAddressingMode,
     * the top 3 bits are don't care
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  addr    Value of target own address [0x00, 0x3FF]
     *                      目标地址值。
     */
    __STATIC_INLINE void DL_I2C_setTargetOwnAddress(I2C_Regs *i2c, uint32_t addr)
    {
        DL_Common_updateReg(&i2c->SLAVE.SOAR, addr, I2C_SOAR_OAR_MASK);
    }

    /**
     *  @brief      Get target own address
     *              获取目标自身地址。
     *
     * Get bits A9 through A0 of the target own address.
     *
     * In 7-bit addressing mode as selected by @ref DL_I2C_setTargetAddressingMode,
     * the top 3 bits are don't care
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @return     Target own address
     *              返回值：目标地址 [0x00, 0x3FF]。
     *
     *  @retval     [0x00, 0x3FF]
     */
    __STATIC_INLINE uint32_t DL_I2C_getTargetOwnAddress(const I2C_Regs *i2c)
    {
        return (i2c->SLAVE.SOAR & I2C_SOAR_OAR_MASK);
    }

    /**
     *  @brief      Enable target own address
     *              启用目标自身地址。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @sa DL_I2C_setTargetOwnAddress
     */
    __STATIC_INLINE void DL_I2C_enableTargetOwnAddress(I2C_Regs *i2c)
    {
        i2c->SLAVE.SOAR |= I2C_SOAR_OAREN_ENABLE;
    }

    /**
     *  @brief      Disable target own address
     *              禁用目标自身地址。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTargetOwnAddress(I2C_Regs *i2c)
    {
        i2c->SLAVE.SOAR &= ~(I2C_SOAR_OAREN_MASK);
    }

    /**
     *  @brief      Checks if target own address is enabled
     *              检查目标自身地址是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target own address is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if target own address is enabled
     *  @retval     false if target own address is disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetOwnAddressEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SOAR & I2C_SOAR_OAREN_MASK) == I2C_SOAR_OAREN_ENABLE);
    }

    /**
     *  @brief      Set target addressing mode
     *              设置目标寻址模式（7 位或 10 位）。
     *
     *  Selects the addressing mode to be used when device is configured as a
     *  target
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  mode    Addressing mode to set the target to.
     *                      One of @ref DL_I2C_TARGET_ADDRESSING_MODE.
     *                      寻址模式。
     */
    __STATIC_INLINE void DL_I2C_setTargetAddressingMode(
        I2C_Regs *i2c, DL_I2C_TARGET_ADDRESSING_MODE mode)
    {
        DL_Common_updateReg(
            &i2c->SLAVE.SOAR, (uint32_t)mode, I2C_SOAR_SMODE_MASK);
    }

    /**
     *  @brief      Get target addressing mode
     *              获取目标寻址模式。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Addressing mode the target is set to
     *              返回值：当前目标寻址模式。
     *
     *  @retval     One of @ref DL_I2C_TARGET_ADDRESSING_MODE
     */
    __STATIC_INLINE DL_I2C_TARGET_ADDRESSING_MODE DL_I2C_getTargetAddressingMode(
        const I2C_Regs *i2c)
    {
        uint32_t mode = i2c->SLAVE.SOAR & I2C_SOAR_SMODE_MASK;

        return (DL_I2C_TARGET_ADDRESSING_MODE)(mode);
    }

    /**
     *  @brief      Get target own address alternate
     *              获取目标备用自身地址。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @return     Target own address alternate
     *              返回值：备用地址 [0x00, 0x7f]。
     *
     *  @retval     [0x00, 0x7f]
     */
    __STATIC_INLINE uint32_t I2C_getTargetOwnAddressAlternate(const I2C_Regs *i2c)
    {
        return (i2c->SLAVE.SOAR2 & I2C_SOAR2_OAR2_MASK);
    }

    /**
     *  @brief      Set target own address alternate
     *              设置目标备用自身地址。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  addr    Value of target own address alternate [0x00, 0x7f]
     *                      备用地址值。
     */
    __STATIC_INLINE void DL_I2C_setTargetOwnAddressAlternate(
        I2C_Regs *i2c, uint32_t addr)
    {
        DL_Common_updateReg(&i2c->SLAVE.SOAR2, addr, I2C_SOAR2_OAR2_MASK);
    }

    /**
     *  @brief      Get target own address alternate mask
     *              获取目标备用地址掩码。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Which bits of the target address are matched
     *              返回值：地址匹配位掩码 [0x00, 0x7F]。
     *
     *  @retval     Bit mask with each bit corresponding to bits A6 through A0 of
     *              the target address. Value between [0x00, 0x7F]
     */
    __STATIC_INLINE uint32_t DL_I2C_getTargetOwnAddressAlternateMask(
        const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SOAR2 & I2C_SOAR2_OAR2_MASK_MASK) >>
                I2C_SOAR2_OAR2_MASK_OFS);
    }

    /**
     *  @brief      Set target own address alternate mask
     *              设置目标备用地址掩码。掩码为 1 的位将忽略对应地址位。
     *
     * This field specifies bits A6 through A0 of the target address. The bits with
     * a value of 1 in the SOAR2.OAR2_MASK field will make the corresponding
     * incoming address bits to match by default regardless of the value inside
     * SOAR2.OAR2 i.e. corresponding SOAR2.OAR2 bit is a don't care.
     *
     *  @param[in]  i2c           Pointer to the register overlay for the peripheral
     *                            I2C 外设寄存器基址。
     *  @param[in]  addressMask   Bit mask of address bits to match.
     *                            Value between [0x00, 0x7F]
     *                            地址匹配位掩码。
     */
    __STATIC_INLINE void DL_I2C_setTargetOwnAddressAlternateMask(
        I2C_Regs *i2c, uint32_t addressMask)
    {
        DL_Common_updateReg(&i2c->SLAVE.SOAR2,
                            addressMask << I2C_SOAR2_OAR2_MASK_OFS, I2C_SOAR2_OAR2_MASK_MASK);
    }

    /**
     *  @brief      Disable usage of target own address alternate
     *              禁用目标备用自身地址。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTargetOwnAddressAlternate(I2C_Regs *i2c)
    {
        i2c->SLAVE.SOAR2 &= ~(I2C_SOAR2_OAR2EN_MASK);
    }

    /**
     *  @brief      Checks if target own address alternate is enabled
     *              检查目标备用自身地址是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target own address alternate is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if target own address alternate is enabled
     *  @retval     false if target own address alternate is disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetOwnAddressAlternateEnabled(
        const I2C_Regs *i2c)
    {
        return (
            (i2c->SLAVE.SOAR2 & I2C_SOAR2_OAR2EN_MASK) == I2C_SOAR2_OAR2EN_ENABLE);
    }

    /**
     *  @brief      Enable usage of target own address alternate
     *              启用目标备用自身地址。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableTargetOwnAddressAlternate(I2C_Regs *i2c)
    {
        i2c->SLAVE.SOAR2 |= I2C_SOAR2_OAR2EN_ENABLE;
    }

    /**
     *  @brief      Get the address for which address match happened
     *              获取地址匹配到的目标地址。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Matched Target address
     *              返回值：匹配到的地址。
     *
     *  @retval     Bit mask with each bit corresponding to the target address.
     *  Value between [0x00, 0x7F] in 7-bit mode, or [0x00, 0x3FF] in 10-bit mode.
     */
    __STATIC_INLINE uint32_t DL_I2C_getTargetAddressMatch(const I2C_Regs *i2c)
    {
        return (
            (i2c->SLAVE.SSR & I2C_SSR_ADDRMATCH_MASK) >> I2C_SSR_ADDRMATCH_OFS);
    }

    /**
     *  @brief      Disable target clock stretching
     *              禁用目标时钟延展。
     *
     *  Clock stretching should be enabled to be compliant with I2C specification
     *  and the SCL will be stretched when data must be read or written from the
     *  FIFO. It can optionally be disabled if a controller does not support it or
     *  to achieve maximum I2C frequency; however the developer should ensure that
     *  the FIFO is written or read on time.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTargetClockStretching(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_SCLKSTRETCH_MASK);
    }

    /**
     *  @brief      Checks if target clock stretching is enabled
     *              检查目标时钟延展是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target clock stretching is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if target clock stretching is enabled
     *  @retval     false if target clock stretching is disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetClockStretchingEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SCTR & I2C_SCTR_SCLKSTRETCH_MASK) ==
                I2C_SCTR_SCLKSTRETCH_ENABLE);
    }

    /**
     *  @brief      Enable target clock stretching
     *              启用目标时钟延展。
     *
     *  Clock stretching should be enabled to be compliant with I2C specification
     *  and the SCL will be stretched when data must be read or written from the
     *  FIFO. It can optionally be disabled if a controller does not support it or
     *  to achieve maximum I2C frequency; however the developer should ensure that
     *  the FIFO is written or read on time.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableTargetClockStretching(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_SCLKSTRETCH_ENABLE;
    }

    /**
     *  @brief      Disable target TX empty interrupt on transmit request
     *              禁用目标发送请求时的 TX FIFO 空中断。
     *
     * When disabled, RIS.STXEMPTY will be set when only the Target TX FIFO is
     * empty. This allows the STXEMPTY interrupt to be used to indicate that the
     * I2C bus is being clock stretched and that Target TX data is required.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @sa         DL_I2C_isTargetClockStretchEnabled
     */
    __STATIC_INLINE void DL_I2C_disableTargetTXEmptyOnTXRequest(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_TXEMPTY_ON_TREQ_MASK);
    }

    /**
     *  @brief      Checks if target TX empty interrupt on transmit request is
     *              enabled
     *              检查目标发送请求时 TX FIFO 空中断是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If TX empty interrupt on transmit request is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if TX empty interrupt on transmit request is enabled
     *  @retval     false if TX empty interrupt on transmit request disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetTXEmptyOnTXRequestEnabled(
        const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SCTR & I2C_SCTR_TXEMPTY_ON_TREQ_MASK) ==
                I2C_SCTR_TXEMPTY_ON_TREQ_ENABLE);
    }

    /**
     *  @brief      Enable target TX empty interrupt on transmit request
     *              启用目标发送请求时的 TX FIFO 空中断。
     *
     *  When enabled, RIS.STXEMPTY will be set when the Target state machine is in
     *  the TX_WAIT state which occurs when the TX FIFO is empty AND the I2C
     *  transaction is clock stretched waiting for the FIFO to receive data.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableTargetTXEmptyOnTXRequest(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_TXEMPTY_ON_TREQ_ENABLE;
    }

    /**
     *  @brief      Disable target TX trigger in TX mode
     *              禁用目标 TX 模式下的 TX FIFO 触发。
     *
     * When disabled, RIS.TXFIFOTRG will only be set when the Target TX FIFO is at
     * or above the trigger level.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTargetTXTriggerInTXMode(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_TXTRIG_TXMODE_MASK);
    }

    /**
     *  @brief      Checks if target TX trigger in TX mode is enabled
     *              检查目标 TX 模式下 TX FIFO 触发是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target TX trigger in TX mode is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if target TX trigger in TX mode is enabled
     *  @retval     false if target TX trigger in TX mode is disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetTXTriggerInTXModeEnabled(
        const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SCTR & I2C_SCTR_TXTRIG_TXMODE_MASK) ==
                I2C_SCTR_TXTRIG_TXMODE_ENABLE);
    }

    /**
     *  @brief      Enable TX trigger when target is in TX mode
     *              启用目标 TX 模式下的 TX FIFO 触发。
     *
     *  When enabled, RIS.TXFIFOTRG will be set when the Target TX FIFO has reached
     *  the trigger level AND the Target state machine is in the TXMODE as defined
     *  in the SSR register. When cleared RIS.TXFIFOTRG will be set when the Target
     *  TX FIFO is at or above the trigger level. This setting can be used to hold
     *  off the TX DMA until a transaction starts. This allows the DMA to be
     *  configured when the I2C is idle but have it wait till the transaction
     *  starts to load the Target TX FIFO, so it can load from a memory buffer that
     *  might be changing over time.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @sa                 DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER
     */
    __STATIC_INLINE void DL_I2C_enableTargetTXTriggerInTXMode(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_TXTRIG_TXMODE_ENABLE;
    }

