zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
    /**
     *  @brief      Disable target TX transfer waits when stale data in TX FIFO
     *              禁用目标 TX FIFO 数据过期时的传输等待。
     *
     *  When disabled, the TX FIFO empty signal to the Target state machine
     *  indicates that the TX FIFO is empty.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTargetTXWaitWhenTXFIFOStale(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_TXWAIT_STALE_TXFIFO_MASK);
    }

    /**
     *  @brief      Checks if target TX transfer waits when stale data in TX FIFO
     *              is enabled
     *              检查目标 TX FIFO 数据过期等待是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target TX transfer waits when stale data in TX FIFO is
     *              enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true   if target TX transfer waits when stale data in TX FIFO
     *                     is enabled
     *  @retval     false  if target TX transfer waits when stale data in TX FIFO
     *                     is disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetTXWaitWhenTXFIFOStaleEnabled(
        const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SCTR & I2C_SCTR_TXWAIT_STALE_TXFIFO_MASK) ==
                I2C_SCTR_TXWAIT_STALE_TXFIFO_ENABLE);
    }

    /**
     *  @brief      Enable target TX transfer waits when stale data in TX FIFO
     *              启用目标 TX FIFO 数据过期时的传输等待。
     *
     *  When enabled, the TX FIFO empty signal to the Target state machine will
     *  indicate that the TX FIFO is empty or that the TX FIFO data is stale. The
     *  TX FIFO data is determined to be stale when there is data in the TX FIFO
     *  when the Target state machine leaves the TXMODE as defined in the SSR
     *  register. This can occur is a Stop or timeout occur when there are bytes
     *  left in the TX FIFO.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableTargetTXWaitWhenTXFIFOStale(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_TXWAIT_STALE_TXFIFO_ENABLE;
    }

    /**
     *  @brief      Disable target RX full interrupt on receive request
     *              禁用目标接收请求时的 RX FIFO 满中断。
     *
     *  When disabled, RIS.SRXFULL will be set when only the Target RX FIFO is
     *  full. This allows the SRXFULL interrupt to be used to indicate that the
     *  I2C bus is being clock stretched and that the FW must either read the RX
     *  FIFO or ACK/NACK the current RX byte.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @sa         DL_I2C_isTargetClockStretchEnabled
     */
    __STATIC_INLINE void DL_I2C_disableTargetRXFullOnRXRequest(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_RXFULL_ON_RREQ_MASK);
    }

    /**
     *  @brief      Checks if target RX full interrupt on receive request is enabled
     *              检查目标接收请求时 RX FIFO 满中断是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target RX full interrupt on receive request enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true   if target RX full interrupt on receive request enabled
     *  @retval     false  if target RX full interrupt on receive request disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetRXFullOnRXRequestEnabled(
        const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SCTR & I2C_SCTR_RXFULL_ON_RREQ_MASK) ==
                I2C_SCTR_RXFULL_ON_RREQ_ENABLE);
    }

    /**
     *  @brief      Enable target RX full interrupt on receive request
     *              启用目标接收请求时的 RX FIFO 满中断。
     *
     *  When enabled, RIS.SRXFULL will be set when the Target state machine is in
     *  the RX_WAIT or RX_ACK_WAIT states which occurs when the I2C transaction is
     *  clock stretched because the RX FIFO is full or the ACKOEN has been set and
     *  the state machine is waiting for FW to ACK/NACK the current byte.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableTargetRXFullOnRXRequest(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_RXFULL_ON_RREQ_ENABLE;
    }

    /**
     *  @brief      Disable SMBus/PMBus default host address of 000 1000b
     *              禁用 SMBus/PMBus 默认主机地址 0x08。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableDefaultHostAddress(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_EN_DEFHOSTADR_MASK);
    }

    /**
     *  @brief      Checks if SMBus/PMBus default host address of 000 1000b is
     *              enabled
     *              检查 SMBus/PMBus 默认主机地址是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If default host address is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true   if default host address is enabled
     *  @retval     false  if default host address disabled
     */
    __STATIC_INLINE bool DL_I2C_isDefaultHostAddressEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SCTR & I2C_SCTR_EN_DEFHOSTADR_MASK) ==
                I2C_SCTR_EN_DEFHOSTADR_ENABLE);
    }

    /**
     *  @brief      Enable SMBus/PMBus default host address of 000 1000b
     *              启用 SMBus/PMBus 默认主机地址 0x08。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableDefaultHostAddress(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_EN_DEFHOSTADR_ENABLE;
    }

    /**
     *  @brief      Disable SMBus/PMBus Alert response address (ARA) of 000 1100b
     *              禁用 SMBus/PMBus 告警响应地址 0x0C。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableAlertResponseAddress(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_EN_ALRESPADR_MASK);
    }

    /**
     *  @brief      Checks if SMBus/PMBus Alert response address (ARA) of 000 1100b
     *              is enabled
     *              检查 SMBus/PMBus 告警响应地址是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If alert response address is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true   if alert response address is enabled
     *  @retval     false  if alert response address disabled
     */
    __STATIC_INLINE bool DL_I2C_isAlertResponseAddressEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SCTR & I2C_SCTR_EN_ALRESPADR_MASK) ==
                I2C_SCTR_EN_ALRESPADR_ENABLE);
    }

    /**
     *  @brief      Enable SMBus/PMBus Alert response address (ARA) of 000 1100b
     *              启用 SMBus/PMBus 告警响应地址 0x0C。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableAlertResponseAddress(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_EN_ALRESPADR_ENABLE;
    }

    /**
     *  @brief      Disable SMBus/PMBus default device address of 110 0001b
     *              禁用 SMBus/PMBus 默认设备地址 0x61（ARP 用）。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableDefaultDeviceAddress(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_EN_DEFDEVADR_MASK);
    }

    /**
     *  @brief      Checks SMBus/PMBus default device address of 110 0001b is
     *              enabled
     *              检查 SMBus/PMBus 默认设备地址是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If default device address is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true   if default device address is enabled
     *  @retval     false  if default device address disabled
     */
    __STATIC_INLINE bool DL_I2C_isDefaultDeviceAddressEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SCTR & I2C_SCTR_EN_DEFDEVADR_MASK) ==
                I2C_SCTR_EN_DEFDEVADR_ENABLE);
    }

    /**
     *  @brief      Enable SMBus/PMBus default device address of 110 0001b
     *              启用 SMBus/PMBus 默认设备地址 0x61（ARP 用）。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableDefaultDeviceAddress(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_EN_DEFDEVADR_ENABLE;
    }

    /**
     *  @brief      Disable target wakeup
     *              禁用目标唤醒功能。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTargetWakeup(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_SWUEN_MASK);
    }

    /**
     *  @brief      Checks if target wakeup is enabled
     *              检查目标唤醒功能是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target wakeup is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true   if target wakeup is enabled
     *  @retval     false  if target wakeup disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetWakeupEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SCTR & I2C_SCTR_SWUEN_MASK) == I2C_SCTR_SWUEN_ENABLE);
    }

    /**
     *  @brief      Enable target wakeup
     *              启用目标唤醒功能，建议同时启用时钟延展以等待模块唤醒。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @sa         DL_I2C_enableTargetClockStretching
     */
    __STATIC_INLINE void DL_I2C_enableTargetWakeup(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_SWUEN_ENABLE;
    }

    /**
     *  @brief      Disable target functionality
     *              禁用目标功能。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTarget(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_ACTIVE_MASK);
    }

    /**
     *  @brief      Checks if target functionality is enabled
     *              检查目标功能是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target functionality is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if target functionality is enabled
     *  @retval     false if target functionality is disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetEnabled(const I2C_Regs *i2c)
    {
        return (
            (i2c->SLAVE.SCTR & I2C_SCTR_ACTIVE_MASK) == I2C_SCTR_ACTIVE_ENABLE);
    }

    /**
     *  @brief      Enable usage of target functionality
     *              启用目标功能。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableTarget(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_ACTIVE_ENABLE;
    }

    /**
     *  @brief      Disable general call address of 000 0000b
     *              禁用通用呼叫地址 0x00。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableGeneralCall(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR &= ~(I2C_SCTR_GENCALL_MASK);
    }

    /**
     *  @brief      Checks if general call address of 000 0000b is enabled
     *              检查通用呼叫地址 0x00 是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If general call is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if general call is enabled
     *  @retval     false if general call is disabled
     */
    __STATIC_INLINE bool DL_I2C_isGeneralCallEnabled(const I2C_Regs *i2c)
    {
        return (
            (i2c->SLAVE.SCTR & I2C_SCTR_GENCALL_MASK) == I2C_SCTR_GENCALL_ENABLE);
    }

    /**
     *  @brief      Enable usage of general call address of 000 0000b
     *              启用通用呼叫地址 0x00。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableGeneralCall(I2C_Regs *i2c)
    {
        i2c->SLAVE.SCTR |= I2C_SCTR_GENCALL_ENABLE;
    }

    /**
     *  @brief      Get status of I2C bus controller for target
     *              获取目标状态寄存器值。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @return     Status of I2C bus controller for target
     *              返回值：目标状态，@ref DL_I2C_TARGET_STATUS 的按位或。
     *
     *  @retval     Bitwise OR of @ref DL_I2C_TARGET_STATUS
     */
    __STATIC_INLINE uint32_t DL_I2C_getTargetStatus(const I2C_Regs *i2c)
    {
        return (i2c->SLAVE.SSR);
    }

    /**
     *  @brief      Get byte of data from I2C target
     *              从目标 RX 数据寄存器读取 1 字节。
     *
     *  If using FIFO, it is first byte from the RX FIFO.
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *
     *  @return     Last received byte of data
     *              返回值：接收到的数据字节 [0x00, 0xff]。
     *
     *  @retval     [0x00, 0xff]
     */
    __STATIC_INLINE uint8_t DL_I2C_receiveTargetData(const I2C_Regs *i2c)
    {
        return (uint8_t)(i2c->SLAVE.SRXDATA & I2C_SRXDATA_VALUE_MASK);
    }

    /**
     *  @brief      Set next byte to be transferred during the next transaction
     *              写入目标 TX 数据寄存器，待控制器读取时发送。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  data    Byte of data to be transferred during the next
     *                      transaction. [0x00, 0xff]
     *                      待发送数据字节。
     */
    __STATIC_INLINE void DL_I2C_transmitTargetData(I2C_Regs *i2c, uint8_t data)
    {
        i2c->SLAVE.STXDATA = data;
    }

    /**
     *  @brief      Disable target ACK override
     *              禁用目标 ACK 覆盖，恢复自动应答。
     *
     *  Disable manual ACK override to automatically ACK all received bytes until
     *  the RX FIFO is full.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTargetACKOverride(I2C_Regs *i2c)
    {
        i2c->SLAVE.SACKCTL &= ~(I2C_SACKCTL_ACKOEN_MASK);
    }

    /**
     *  @brief      Checks if target ACK override is enabled
     *              检查目标 ACK 覆盖是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target ACK override is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if target ACK override is enabled
     *  @retval     false if target ACK override is disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetACKOverrideEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SACKCTL & I2C_SACKCTL_ACKOEN_MASK) ==
                I2C_SACKCTL_ACKOEN_ENABLE);
    }

    /**
     *  @brief      Enable target ACK override
     *              启用目标 ACK 覆盖，SCL 将被拉低直到软件写入应答值。
     *
     *  When manual ACK override is enabled, the I2C target SCL is pulled low after
     *  the last data is received until the ACK override value (through
     *  @ref DL_I2C_setTargetACKOverrideValue) is written.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableTargetACKOverride(I2C_Regs *i2c)
    {
        i2c->SLAVE.SACKCTL |= I2C_SACKCTL_ACKOEN_ENABLE;
    }

    /**
     *  @brief      Get target acknowledge override value
     *              获取目标应答覆盖值（ACK 或 NACK）。
     *
     *  @note for General Call this bit will be ignored if set to NACK and target
     *  continues to receive data.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     What type of response will be generated
     *              返回值：应答覆盖值。
     *
     *  @retval     One of @ref DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE.
     */
    __STATIC_INLINE DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE
    DL_I2C_getTargetACKOverrideValue(const I2C_Regs *i2c)
    {
        uint32_t value = i2c->SLAVE.SACKCTL & I2C_SACKCTL_ACKOVAL_MASK;

        return (DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE)(value);
    }

    /**
     *  @brief      Set target acknowledge override value
     *              设置目标应答覆盖值（ACK 或 NACK）。
     *
     *  @note for General Call this bit will be ignored if set to NACK and target
     *  continues to receive data.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  value   Indicates what type of response will be generated.
     *                      One of @ref DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE.
     *                      应答覆盖值。
     *
     *  @sa         DL_I2C_enableTargetACKOverride
     */
    __STATIC_INLINE void DL_I2C_setTargetACKOverrideValue(
        I2C_Regs *i2c, DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE value)
    {
        DL_Common_updateReg(
            &i2c->SLAVE.SACKCTL, (uint32_t)value, I2C_SACKCTL_ACKOVAL_MASK);
    }

    /**
     *  @brief      Disable target ACK override on Start Condition
     *              禁用目标 START 条件后的 ACK 覆盖。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableACKOverrideOnStart(I2C_Regs *i2c)
    {
        i2c->SLAVE.SACKCTL &= ~(I2C_SACKCTL_ACKOEN_ON_START_MASK);
    }

    /**
     *  @brief      Checks if target ACK override on Start condition is enabled
     *              检查目标 START 条件后的 ACK 覆盖是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target ACK override on Start condition is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if target ACK override on Start condition is enabled
     *  @retval     false if target ACK override on Start condition is disabled
     */
    __STATIC_INLINE bool DL_I2C_isACKOverrideOnStartEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SACKCTL & I2C_SACKCTL_ACKOEN_ON_START_MASK) ==
                I2C_SACKCTL_ACKOEN_ON_START_ENABLE);
    }

    /**
     *  @brief      Enable target ACK override on Start condition
     *              启用目标 START 条件后的 ACK 覆盖。
     *
     *  When enabled, this bit will automatically turn on the Target ACKOEN field
     *  following a Start condition.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @sa                 DL_I2C_enableTargetACKOverride
     */
    __STATIC_INLINE void DL_I2C_enableACKOverrideOnStart(I2C_Regs *i2c)
    {
        i2c->SLAVE.SACKCTL |= I2C_SACKCTL_ACKOEN_ON_START_ENABLE;
    }

    /**
     *  @brief      Disable target ACK override when SMBus/PMBus PEC is next byte
     *              禁用 PEC 字节前的 ACK 覆盖。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableACKOverrideOnPECNext(I2C_Regs *i2c)
    {
        i2c->SLAVE.SACKCTL &= ~(I2C_SACKCTL_ACKOEN_ON_PECNEXT_MASK);
    }

    /**
     *  @brief      Checks if target ACK override when SMBus/PMBus PEC is next byte
     *              is enabled
     *              检查 PEC 字节前的 ACK 覆盖是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target ACK override when PEC is next byte is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if target ACK override when PEC is next byte is enabled
     *  @retval     false if target ACK override when PEC is next byte is disabled
     */
    __STATIC_INLINE bool DL_I2C_isACKOverrideOnPECNextEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SACKCTL & I2C_SACKCTL_ACKOEN_ON_PECNEXT_MASK) ==
                I2C_SACKCTL_ACKOEN_ON_PECNEXT_ENABLE);
    }

    /**
     *  @brief      Enable target ACK override when SMBus/PMBus PEC is next byte
     *              启用 PEC 字节前的 ACK 覆盖。
     *
     *  When enabled, this bit will automatically turn on the Target ACKOEN field
     *  following the ACK/NACK of the byte received just prior to the PEC byte.
     *  Note that when ACKOEN is set, the PEC byte will not automatically be
     *  ACKed/NACKed by the state machine and FW must perform this function by
     *  writing SLAVE_SACKCTL.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @sa                 DL_I2C_enableTargetACKOverride
     */
    __STATIC_INLINE void DL_I2C_enableACKOverrideOnPECNext(I2C_Regs *i2c)
    {
        i2c->SLAVE.SACKCTL |= I2C_SACKCTL_ACKOEN_ON_PECNEXT_ENABLE;
    }

    /**
     *  @brief      Disable target ACK override when SMBus/PMBus PEC is next byte
     *              禁用 PEC 字节接收完成后的 ACK 覆盖。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableACKOverrideOnPECDone(I2C_Regs *i2c)
    {
        i2c->SLAVE.SACKCTL &= ~(I2C_SACKCTL_ACKOEN_ON_PECDONE_MASK);
    }

    /**
     *  @brief      Checks if target ACK override when SMBus/PMBus PEC is next byte
     *              is enabled
     *              检查 PEC 字节接收完成后的 ACK 覆盖是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target ACK override when PEC is next byte is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if target ACK override when PEC is next byte is enabled
     *  @retval     false if target ACK override when PEC is next byte is disabled
     */
    __STATIC_INLINE bool DL_I2C_isACKOverrideOnPECDoneEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SACKCTL & I2C_SACKCTL_ACKOEN_ON_PECDONE_MASK) ==
                I2C_SACKCTL_ACKOEN_ON_PECDONE_ENABLE);
    }

