zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
    /**
     *  @brief      Enable target ACK override when SMBus/PMBus PEC is done
     *              启用 PEC 字节接收完成后的 ACK 覆盖。
     *
     *  When enabled, this bit will automatically turn on the Target ACKOEN field
     * following the ACK/NACK of the received PEC byte.
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @sa                 DL_I2C_enableTargetACKOverride
     */
    __STATIC_INLINE void DL_I2C_enableACKOverrideOnPECDone(I2C_Regs *i2c)
    {
        i2c->SLAVE.SACKCTL |= I2C_SACKCTL_ACKOEN_ON_PECDONE_ENABLE;
    }

    /**
     *  @brief      Get the target SMBus/PMBus Packet Error Checking (PEC) count
     *              value
     *              获取目标 PEC 计数值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     The value the PEC count is set to
     *              返回值：PEC 计数值 [0x0, 0x01FF]。
     *
     *  @retval     Value between [0x0, 0x01FF]
     */
    __STATIC_INLINE uint32_t DL_I2C_getTargetPECCountValue(const I2C_Regs *i2c)
    {
        return (i2c->SLAVE.TARGET_PECCTL & I2C_TARGET_PECCTL_PECCNT_MASK);
    }

    /**
     *  @brief      Set the target SMBus/PMBus Packet Error Checking (PEC) count
     *              value
     *              设置目标 PEC 计数值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  count   The value to set the PEC count to.
     *                      Value between [0x0, 0x01FF]
     *                      PEC 计数值。
     */
    __STATIC_INLINE void DL_I2C_setTargetPECCountValue(
        I2C_Regs *i2c, uint32_t count)
    {
        DL_Common_updateReg(
            &i2c->SLAVE.TARGET_PECCTL, count, I2C_TARGET_PECCTL_PECCNT_MASK);
    }

    /**
     *  @brief      Disable target SMBus/PMBus Packet Error Checking (PEC)
     *              禁用目标 PEC 校验。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTargetPEC(I2C_Regs *i2c)
    {
        i2c->SLAVE.TARGET_PECCTL &= ~(I2C_TARGET_PECCTL_PECEN_MASK);
    }

    /**
     *  @brief      Checks if target SMBus/PMBus Packet Error Checking (PEC) is
     *              enabled
     *              检查目标 PEC 校验是否已启用。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     If target PEC is enabled
     *              返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if target PEC is enabled
     *  @retval     false if target PEC is disabled
     */
    __STATIC_INLINE bool DL_I2C_isTargetPECEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.TARGET_PECCTL & I2C_TARGET_PECCTL_PECEN_MASK) ==
                I2C_TARGET_PECCTL_PECEN_ENABLE);
    }

    /**
     *  @brief      Enable target SMBus/PMBus Packet Error Checking (PEC)
     *              启用目标 PEC 校验，多项式为 x^8 + x^2 + x^1 + 1。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableTargetPEC(I2C_Regs *i2c)
    {
        i2c->SLAVE.TARGET_PECCTL |= I2C_TARGET_PECCTL_PECEN_ENABLE;
    }

    /**
     *  @brief      Get the current SMBus/PMBus PEC byte count of the Target state
     *              machine
     *              获取目标状态机当前 PEC 字节计数。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     The current PEC byte count of the target state machine
     *              返回值：当前 PEC 字节计数 [0x0, 0x01FF]。
     *
     *  @retval     Value between [0x0, 0x01FF]
     */
    __STATIC_INLINE uint32_t DL_I2C_getTargetCurrentPECCount(const I2C_Regs *i2c)
    {
        return (i2c->SLAVE.TARGET_PECSR & I2C_TARGET_PECSR_PECBYTECNT_MASK);
    }

    /**
     *  @brief      Get status if SMBus/PMBus target PEC was checked in last
     *              transaction
     *              查询上次事务是否执行了目标 PEC 校验。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Status of PEC target checked
     *              返回值：PEC 校验状态。
     *
     *  @retval     One of @ref DL_I2C_TARGET_PEC_STATUS
     */
    __STATIC_INLINE DL_I2C_TARGET_PEC_STATUS DL_I2C_getTargetPECCheckedStatus(
        const I2C_Regs *i2c)
    {
        uint32_t status =
            i2c->SLAVE.TARGET_PECSR & I2C_TARGET_PECSR_PECSTS_CHECK_MASK;

        return (DL_I2C_TARGET_PEC_STATUS)(status);
    }

    /**
     *  @brief      Get status if SMBus/PMBus target PEC had an error
     *              查询上次事务的目标 PEC 校验错误状态。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *
     *  @return     Status of target PEC error check
     *              返回值：PEC 校验错误状态。
     *
     *  @retval     One of @ref DL_I2C_TARGET_PEC_CHECK_ERROR
     */
    __STATIC_INLINE DL_I2C_TARGET_PEC_CHECK_ERROR DL_I2C_getTargetPECCheckError(
        const I2C_Regs *i2c)
    {
        uint32_t status =
            i2c->SLAVE.TARGET_PECSR & I2C_TARGET_PECSR_PECSTS_ERROR_MASK;

        return (DL_I2C_TARGET_PEC_CHECK_ERROR)(status);
    }

    /**
     *  @brief      Get target TX FIFO threshold level
     *              获取目标 TX FIFO 触发阈值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @return     返回值：TX FIFO 触发阈值。
     *
     *  @retval     One of @ref DL_I2C_TX_FIFO_LEVEL
     */
    __STATIC_INLINE DL_I2C_TX_FIFO_LEVEL DL_I2C_getTargetTXFIFOThreshold(
        const I2C_Regs *i2c)
    {
        uint32_t level = i2c->SLAVE.SFIFOCTL & I2C_SFIFOCTL_TXTRIG_MASK;

