zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
        return (DL_I2C_TX_FIFO_LEVEL)(level);
    }

    /**
     *  @brief      Set target TX FIFO threshold level
     *              设置目标 TX FIFO 触发阈值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  level   TX FIFO 触发阈值，@ref DL_I2C_TX_FIFO_LEVEL。
     */
    __STATIC_INLINE void DL_I2C_setTargetTXFIFOThreshold(
        I2C_Regs *i2c, DL_I2C_TX_FIFO_LEVEL level)
    {
        DL_Common_updateReg(&i2c->SLAVE.SFIFOCTL, (uint32_t)level,
                            (uint32_t)I2C_SFIFOCTL_TXTRIG_MASK);
    }

    /**
     *  @brief      Stop target TX FIFO flush
     *              停止目标 TX FIFO 刷新。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_stopFlushTargetTXFIFO(I2C_Regs *i2c)
    {
        i2c->SLAVE.SFIFOCTL &= ~(I2C_SFIFOCTL_TXFLUSH_MASK);
    }

    /**
     *  @brief      Start target TX FIFO flush
     *              启动目标 TX FIFO 刷新。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_startFlushTargetTXFIFO(I2C_Regs *i2c)
    {
        i2c->SLAVE.SFIFOCTL |= I2C_SFIFOCTL_TXFLUSH_MASK;
    }

    /**
     *  @brief      Stop target RX FIFO flush
     *              停止目标 RX FIFO 刷新。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_stopFlushTargetRXFIFO(I2C_Regs *i2c)
    {
        i2c->SLAVE.SFIFOCTL &= ~(I2C_SFIFOCTL_RXFLUSH_MASK);
    }

    /**
     *  @brief      Start target RX FIFO flush
     *              启动目标 RX FIFO 刷新。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_startFlushTargetRXFIFO(I2C_Regs *i2c)
    {
        i2c->SLAVE.SFIFOCTL |= I2C_SFIFOCTL_RXFLUSH_MASK;
    }

    /**
     *  @brief      Get target RX FIFO threshold level
     *              获取目标 RX FIFO 触发阈值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @return     返回值：RX FIFO 触发阈值。
     *
     *  @retval     One of @ref DL_I2C_RX_FIFO_LEVEL
     */
    __STATIC_INLINE DL_I2C_RX_FIFO_LEVEL DL_I2C_getTargetRXFIFOThreshold(
        const I2C_Regs *i2c)
    {
        uint32_t level = i2c->SLAVE.SFIFOCTL & I2C_SFIFOCTL_RXTRIG_MASK;

        return (DL_I2C_RX_FIFO_LEVEL)(level);
    }

    /**
     *  @brief      Set target RX FIFO threshold level
     *              设置目标 RX FIFO 触发阈值。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @param[in]  level   RX FIFO 触发阈值，@ref DL_I2C_RX_FIFO_LEVEL。
     */
    __STATIC_INLINE void DL_I2C_setTargetRXFIFOThreshold(
        I2C_Regs *i2c, DL_I2C_RX_FIFO_LEVEL level)
    {
        DL_Common_updateReg(
            &i2c->SLAVE.SFIFOCTL, (uint32_t)level, I2C_SFIFOCTL_RXTRIG_MASK);
    }

    /**
     *  @brief      Get number of bytes which can be read from RX FIFO
     *              获取目标 RX FIFO 中可读取的字节数。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *  @return     返回值：可读字节数 [0x0, 0x8]。
     *
     *  @retval     [0x0, 0x8]
     */
    __STATIC_INLINE uint32_t DL_I2C_getTargetRXFIFOCounter(const I2C_Regs *i2c)
    {
        return (i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_RXFIFOCNT_MASK);
    }

    /**
     *  @brief      Get number of bytes which can be put into TX FIFO
     *              获取目标 TX FIFO 中可写入的字节数。
     *
     *  @param[in]  i2c         Pointer to the register overlay for the peripheral
     *                          I2C 外设寄存器基址。
     *  @return     返回值：可写字节数 [0x0, 0x8]。
     *
     *  @retval     [0x0, 0x8]
     */
    __STATIC_INLINE uint32_t DL_I2C_getTargetTXFIFOCounter(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_TXFIFOCNT_MASK) >>
                I2C_SFIFOSR_TXFIFOCNT_OFS);
    }

    /**
     *  @brief      Checks if target RX FIFO flush is active
     *              检查目标 RX FIFO 刷新是否正在进行。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @return     返回值：`true` 表示刷新中，`false` 表示未刷新。
     *
     *  @retval     true if target RX FIFO flush is active
     *  @retval     false if target RX FIFO flush is not active
     */
    __STATIC_INLINE bool DL_I2C_isTargetRXFIFOFlushActive(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_RXFLUSH_MASK) ==
                I2C_SFIFOSR_RXFLUSH_ACTIVE);
    }

    /**
     *  @brief      Checks if target TX FIFO flush is active
     *              检查目标 TX FIFO 刷新是否正在进行。
     *
     *  @param[in]  i2c     Pointer to the register overlay for the peripheral
     *                      I2C 外设寄存器基址。
     *  @return     返回值：`true` 表示刷新中，`false` 表示未刷新。
     *
     *  @retval     true if target TX FIFO flush is active
     *  @retval     false if target TX FIFO flush is not active
     */
    __STATIC_INLINE bool DL_I2C_isTargetTXFIFOFlushActive(const I2C_Regs *i2c)
    {
        return ((i2c->SLAVE.SFIFOSR & I2C_SFIFOSR_TXFLUSH_MASK) ==
                I2C_SFIFOSR_TXFLUSH_ACTIVE);
    }

    /**
     *  @brief      Enable I2C interrupts
     *              启用 I2C 中断。
     *
     *  @param[in]  i2c            I2C 外设寄存器基址。
     *  @param[in]  interruptMask  中断位掩码，@ref DL_I2C_INTERRUPT 的按位或。
     */
    __STATIC_INLINE void DL_I2C_enableInterrupt(
        I2C_Regs *i2c, uint32_t interruptMask)
    {
        i2c->CPU_INT.IMASK |= interruptMask;
    }

    /**
     *  @brief      Disable I2C interrupts
     *              禁用 I2C 中断。
     *
     *  @param[in]  i2c            I2C 外设寄存器基址。
     *  @param[in]  interruptMask  中断位掩码，@ref DL_I2C_INTERRUPT 的按位或。
     */
    __STATIC_INLINE void DL_I2C_disableInterrupt(
        I2C_Regs *i2c, uint32_t interruptMask)
    {
        i2c->CPU_INT.IMASK &= ~(interruptMask);
    }

    /**
     *  @brief      Check which I2C interrupts are enabled
     *              查询哪些 I2C 中断已启用。
     *
     *  @param[in]  i2c            I2C 外设寄存器基址。
     *  @param[in]  interruptMask  中断位掩码。
     *
     *  @return     返回值：已启用的中断位掩码。
     *
     *  @retval     Bitwise OR of @ref DL_I2C_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_I2C_getEnabledInterrupts(
        const I2C_Regs *i2c, uint32_t interruptMask)
    {
        return (i2c->CPU_INT.IMASK & interruptMask);
    }

    /**
     *  @brief      Check interrupt flag of enabled I2C interrupts
     *              查询已启用的 I2C 中断是否有挂起。
     *
     *  @param[in]  i2c            I2C 外设寄存器基址。
     *  @param[in]  interruptMask  中断位掩码。
     *
     *  @return     返回值：挂起的中断位掩码。
     *
     *  @retval     Bitwise OR of @ref DL_I2C_INTERRUPT values
     *
     *  @sa         DL_I2C_enableInterrupt
     */
    __STATIC_INLINE uint32_t DL_I2C_getEnabledInterruptStatus(
        const I2C_Regs *i2c, uint32_t interruptMask)
    {
        return (i2c->CPU_INT.MIS & interruptMask);
    }

    /**
     *  @brief      Check interrupt flag of any I2C interrupt
     *              查询任意 I2C 中断是否有挂起（无需先启用）。
     *
     *  @param[in]  i2c            I2C 外设寄存器基址。
     *  @param[in]  interruptMask  中断位掩码。
     *
     *  @return     返回值：挂起的中断位掩码。
     *
     *  @retval     Bitwise OR of @ref DL_I2C_INTERRUPT values
     */
    __STATIC_INLINE uint32_t DL_I2C_getRawInterruptStatus(
        const I2C_Regs *i2c, uint32_t interruptMask)
    {
        return (i2c->CPU_INT.RIS & interruptMask);
    }

    /**
     *  @brief      Get highest priority pending I2C interrupt
     *              获取最高优先级的挂起 I2C 中断索引。
     *
     *  @param[in]  i2c  I2C 外设寄存器基址。
     *
     *  @return     返回值：最高优先级中断索引。
     *
     *  @retval     One of @ref DL_I2C_IIDX
     */
    __STATIC_INLINE DL_I2C_IIDX DL_I2C_getPendingInterrupt(const I2C_Regs *i2c)
    {
        return ((DL_I2C_IIDX)i2c->CPU_INT.IIDX);
    }

    /**
     *  @brief      Clear pending I2C interrupts
     *              清除挂起的 I2C 中断标志。
     *
     *  @param[in]  i2c            I2C 外设寄存器基址。
     *  @param[in]  interruptMask  中断位掩码。
     */
    __STATIC_INLINE void DL_I2C_clearInterruptStatus(
        I2C_Regs *i2c, uint32_t interruptMask)
    {
        i2c->CPU_INT.ICLR = interruptMask;
    }

    /**
     *  @brief Enables I2C interrupt for triggering DMA events
     *         启用 I2C 中断作为 DMA 触发条件。
     *
     * @note Only one interrupt source should be enabled at a time.
     *       每次应仅启用一个中断源。
     *
     *  @param[in]  i2c        I2C 外设寄存器基址。
     *  @param[in]  index      事件路由选择，@ref DL_I2C_EVENT_ROUTE。
     *  @param[in]  interrupt  DMA 触发中断，@ref DL_I2C_DMA_INTERRUPT。
     */
    __STATIC_INLINE void DL_I2C_enableDMAEvent(
        I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interrupt)
    {
        switch (index)
        {
        case DL_I2C_EVENT_ROUTE_1:
            i2c->DMA_TRIG1.IMASK = interrupt;
            break;
        case DL_I2C_EVENT_ROUTE_2:
            i2c->DMA_TRIG0.IMASK = interrupt;
            break;
        default:
            break;
        }
    }

    /**
     *  @brief Disables I2C interrupt from triggering DMA events
     *         禁用 I2C 中断作为 DMA 触发条件。
     *
     *  @param[in]  i2c        I2C 外设寄存器基址。
     *  @param[in]  index      事件路由选择，@ref DL_I2C_EVENT_ROUTE。
     *  @param[in]  interrupt  DMA 触发中断，@ref DL_I2C_DMA_INTERRUPT。
     */
    __STATIC_INLINE void DL_I2C_disableDMAEvent(
        I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interrupt)
    {
        switch (index)
        {
        case DL_I2C_EVENT_ROUTE_1:
            i2c->DMA_TRIG1.IMASK &= ~(interrupt);
            break;
        case DL_I2C_EVENT_ROUTE_2:
            i2c->DMA_TRIG0.IMASK &= ~(interrupt);
            break;
        default:
            break;
        }
    }

    /**
     *  @brief Check which I2C interrupt for DMA receive events is enabled
     *         查询哪些 DMA 事件中断已启用。
     *
     *  @param[in]  i2c            I2C 外设寄存器基址。
     *  @param[in]  index          事件路由选择，@ref DL_I2C_EVENT_ROUTE。
     *  @param[in]  interruptMask  中断位掩码。
     *
     *  @return     返回值：已启用的 DMA 事件中断位掩码。
     */
    __STATIC_INLINE uint32_t DL_I2C_getEnabledDMAEvents(
        I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interruptMask)
    {
        volatile uint32_t *pReg = &i2c->DMA_TRIG1.IMASK;

