zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_i2c.h
        return ((*(pReg + (uint32_t)index) & interruptMask));
    }

    /**
     *  @brief Check interrupt flag of enabled I2C interrupt for DMA event
     *         查询已启用的 DMA 事件中断是否有挂起。
     *
     *  @param[in]  i2c            I2C 外设寄存器基址。
     *  @param[in]  index          事件路由选择，@ref DL_I2C_EVENT_ROUTE。
     *  @param[in]  interruptMask  中断位掩码。
     *
     *  @return     返回值：挂起的 DMA 事件中断位掩码。
     *
     *  @sa         DL_I2C_enableDMAEvent
     */
    __STATIC_INLINE uint32_t DL_I2C_getEnabledDMAEventStatus(
        const I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interruptMask)
    {
        const volatile uint32_t *pReg = &i2c->DMA_TRIG1.MIS;

        return ((*(pReg + (uint32_t)index) & interruptMask));
    }

    /**
     *  @brief Check interrupt flag of any I2C interrupt for DMA event
     *         查询任意 DMA 事件中断是否有挂起（无需先启用）。
     *
     *  @param[in]  i2c            I2C 外设寄存器基址。
     *  @param[in]  index          事件路由选择，@ref DL_I2C_EVENT_ROUTE。
     *  @param[in]  interruptMask  中断位掩码。
     *
     *  @return     返回值：挂起的 DMA 事件中断位掩码。
     */
    __STATIC_INLINE uint32_t DL_I2C_getRawDMAEventStatus(
        const I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interruptMask)
    {
        const volatile uint32_t *pReg = &i2c->DMA_TRIG1.RIS;

        return ((*(pReg + (uint32_t)index) & interruptMask));
    }

    /**
     *  @brief Get highest priority pending I2C interrupt for DMA event
     *         获取最高优先级的挂起 DMA 事件中断索引。
     *
     *  @param[in]  i2c        I2C 外设寄存器基址。
     *  @param[in]  index      事件路由选择，@ref DL_I2C_EVENT_ROUTE。
     *
     *  @return     返回值：最高优先级 DMA 事件中断索引。
     *
     *  @retval     One of @ref DL_I2C_DMA_IIDX
     */
    __STATIC_INLINE DL_I2C_DMA_IIDX DL_I2C_getPendingDMAEvent(
        const I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index)
    {
        const volatile uint32_t *pReg = &i2c->DMA_TRIG1.IIDX;

        return (DL_I2C_DMA_IIDX)((*(pReg + (uint32_t)index)));
    }

    /**
     *  @brief Clear pending I2C interrupts for DMA events
     *         清除挂起的 DMA 事件中断标志。
     *
     *  @param[in]  i2c        I2C 外设寄存器基址。
     *  @param[in]  index      事件路由选择，@ref DL_I2C_EVENT_ROUTE。
     *  @param[in]  interrupt  要清除的中断，@ref DL_I2C_DMA_INTERRUPT。
     */
    __STATIC_INLINE void DL_I2C_clearDMAEvent(
        I2C_Regs *i2c, DL_I2C_EVENT_ROUTE index, uint32_t interrupt)
    {
        switch (index)
        {
        case DL_I2C_EVENT_ROUTE_1:
            i2c->DMA_TRIG1.ICLR |= interrupt;
            break;
        case DL_I2C_EVENT_ROUTE_2:
            i2c->DMA_TRIG0.ICLR |= interrupt;
            break;
        default:
            break;
        }
    }

    /**
     *  @brief      Disable analog and digital glitch filter chaining
     *              禁用模拟和数字毛刺滤波器串联。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableGlitchFilterChaining(I2C_Regs *i2c)
    {
        i2c->GFCTL &= ~(I2C_GFCTL_CHAIN_MASK);
    }

    /**
     *  @brief      Checks if analog and digital glitch filter chaining is enabled
     *              检查毛刺滤波器串联是否已启用。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     *
     *  @return     返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if glitch filter chaining is enabled
     *  @retval     false if glitch filter chaining is disabled
     */
    __STATIC_INLINE bool DL_I2C_isGlitchFilterChainingEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->GFCTL & I2C_GFCTL_CHAIN_MASK) == I2C_GFCTL_CHAIN_ENABLE);
    }

    /**
     *  @brief      Enable analog and digital glitch filter chaining
     *              启用模拟和数字毛刺滤波器串联。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableGlitchFilterChaining(I2C_Regs *i2c)
    {
        i2c->GFCTL |= I2C_GFCTL_CHAIN_ENABLE;
    }

    /**
     *  @brief      Get the Timeout Counter A value
     *              获取超时计数器 A 预加载值。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     *  @return     返回值：超时 A 计数值 [0x0, 0xFF]。
     *
     *  @retval     Value between [0x0, 0xFF]
     */
    __STATIC_INLINE uint32_t DL_I2C_getTimeoutACount(const I2C_Regs *i2c)
    {
        return (i2c->TIMEOUT_CTL & I2C_TIMEOUT_CTL_TCNTLA_MASK);
    }

    /**
     *  @brief      Set the Timeout Counter A value
     *              设置超时计数器 A 预加载值，用于 SCL 低电平超时检测。
     *
     *  NOTE: 计数值必须大于 1 才能启用超时。每次计数等于 520 倍功能时钟周期。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     *  @param[in]  count   超时 A 计数值 [0x0, 0xFF]。
     */
    __STATIC_INLINE void DL_I2C_setTimeoutACount(I2C_Regs *i2c, uint32_t count)
    {
        DL_Common_updateReg(&i2c->TIMEOUT_CTL, count, I2C_TIMEOUT_CTL_TCNTLA_MASK);
    }

    /**
     *  @brief      Disable Timeout Counter A
     *              禁用超时计数器 A。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTimeoutA(I2C_Regs *i2c)
    {
        i2c->TIMEOUT_CTL &= ~(I2C_TIMEOUT_CTL_TCNTAEN_MASK);
    }

    /**
     *  @brief      Checks if Timeout Counter A is enabled
     *              检查超时计数器 A 是否已启用。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     *  @return     返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if Timeout Counter A is enabled
     *  @retval     false if Timeout Counter A is disabled
     */
    __STATIC_INLINE bool DL_I2C_isTimeoutAEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->TIMEOUT_CTL & I2C_TIMEOUT_CTL_TCNTAEN_MASK) ==
                I2C_TIMEOUT_CTL_TCNTAEN_ENABLE);
    }

    /**
     *  @brief      Enable Timeout Counter A
     *              启用超时计数器 A。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableTimeoutA(I2C_Regs *i2c)
    {
        i2c->TIMEOUT_CTL |= I2C_TIMEOUT_CTL_TCNTAEN_ENABLE;
    }

    /**
     *  @brief      Get the current Timer Counter A value
     *              获取超时计数器 A 当前计数值。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     *  @return     返回值：当前计数值 [0x0, 0xFF]。
     *
     *  @retval     Value between [0x0, 0xFF]
     */
    __STATIC_INLINE uint32_t DL_I2C_getCurrentTimeoutACounter(const I2C_Regs *i2c)
    {
        return (i2c->TIMEOUT_CNT & I2C_TIMEOUT_CNT_TCNTA_MASK);
    }

    /**
     *  @brief      Get the Timeout Counter B value
     *              获取超时计数器 B 预加载值。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     *  @return     返回值：超时 B 计数值 [0x0, 0xFF]。
     *
     *  @retval     Value between [0x0, 0xFF]
     */
    __STATIC_INLINE uint32_t DL_I2C_getTimeoutBCount(const I2C_Regs *i2c)
    {
        return ((i2c->TIMEOUT_CTL & I2C_TIMEOUT_CTL_TCNTLB_MASK) >>
                I2C_TIMEOUT_CTL_TCNTLB_OFS);
    }

    /**
     *  @brief      Set the Timeout Counter B value
     *              设置超时计数器 B 预加载值，用于 SCL 高电平超时检测。
     *
     *  NOTE: 计数值必须大于 1 才能启用超时。每次计数等于 1 倍功能时钟周期。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     *  @param[in]  count   超时 B 计数值 [0x0, 0xFF]。
     */
    __STATIC_INLINE void DL_I2C_setTimeoutBCount(I2C_Regs *i2c, uint32_t count)
    {
        DL_Common_updateReg(&i2c->TIMEOUT_CTL,
                            (count << I2C_TIMEOUT_CTL_TCNTLB_OFS), I2C_TIMEOUT_CTL_TCNTLB_MASK);
    }

    /**
     *  @brief      Disable Timeout Counter B
     *              禁用超时计数器 B。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_disableTimeoutB(I2C_Regs *i2c)
    {
        i2c->TIMEOUT_CTL &= ~(I2C_TIMEOUT_CTL_TCNTBEN_MASK);
    }

    /**
     *  @brief      Checks if Timeout Counter B is enabled
     *              检查超时计数器 B 是否已启用。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     *  @return     返回值：`true` 表示已启用，`false` 表示已禁用。
     *
     *  @retval     true if Timeout Counter B is enabled
     *  @retval     false if Timeout Counter B is disabled
     */
    __STATIC_INLINE bool DL_I2C_isTimeoutBEnabled(const I2C_Regs *i2c)
    {
        return ((i2c->TIMEOUT_CTL & I2C_TIMEOUT_CTL_TCNTBEN_MASK) ==
                I2C_TIMEOUT_CTL_TCNTBEN_ENABLE);
    }

    /**
     *  @brief      Enable Timeout Counter B
     *              启用超时计数器 B。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     */
    __STATIC_INLINE void DL_I2C_enableTimeoutB(I2C_Regs *i2c)
    {
        i2c->TIMEOUT_CTL |= I2C_TIMEOUT_CTL_TCNTBEN_ENABLE;
    }

    /**
     *  @brief      Get the current Timer Counter B value
     *              获取超时计数器 B 当前计数值。
     *
     *  @param[in]  i2c     I2C 外设寄存器基址。
     *  @return     返回值：当前计数值 [0x0, 0xFF]。
     *
     *  @retval     Value between [0x0, 0xFF]
     */
    __STATIC_INLINE uint32_t DL_I2C_getCurrentTimeoutBCounter(const I2C_Regs *i2c)
    {
        return (i2c->TIMEOUT_CNT & I2C_TIMEOUT_CNT_TCNTB_MASK);
    }

#ifdef __cplusplus
}
#endif

#endif /* __MSPM0_HAS_I2C__ */

#endif /* ti_dl_dl_i2c__include */
/** @}*/
